[
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAMVnHFh_IbJak2Lg1O20HiBAQLWyrLUX3E3L6&s=0",
    "title": "Intern - Data Analytics (Finance) Available Summer 2026 | Alexandria, VA, USA",
    "description": "Intern - Data Analytics (Finance) Available Summer 2026\n\nJOB TITLE: Intern- Data Analytics\n\nJob Classification: Temporary Part-Time/Non-Exempt\n\nReports to: EVP, Chief Operating Officer / Data Analytics Director\n\nEducation requirements:\n\n• 4-year college degree, or currently pursuing\nExperience or Skill requirements:\n\n• Professional written and verbal communication skills\n• High level of professionalism\n• Highly organized with attention to detail\n• Ability to follow instructions after given and work independently on multiple tasks.\n• Computer experience required, with working knowledge of Microsoft Word, Excel, and Outlook\n• General knowledge of data analytic scripting preferred\nDuties:\n\n• Assist department with special projects as assigned\n• Import, scrub, export, profile, verify, sort, group, combine and sample data\n• Develop analytical scripts for assigned project\n• Document results of analytical testing\n• Create visualization reports for results of analytical project\nRelationships:\n\nThe Intern could potentially work with all bank employees, specifically those in the area of Operations. The Intern will report directly to the EVP, Chief Operating Officer\n\nBurke & Herbert Bank provides equal employment opportunities in all aspects of employment. All employment decisions are made without regard to race, color, religion, age, sex (including pregnancy, sexual orientation, or gender identity), national origin, disability status, genetics, protected veteran status, or any other characteristic protected by federal, state, or local laws.",
    "company": "Burke & Herbert Bank & Trust",
    "location": "Alexandria, US",
    "url": "https://www.efinancialcareers.com/jobs-USA-VA-Alexandria-Intern_-_Data_Analytics_Finance_Available_Summer_2026.id23330878?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-17T08:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSj274rH0OoVvsmnxHFvhCnhdbMzJOe3pvy_HEL&s=0",
    "title": "Summer 2026 Software Engineer Intern",
    "description": "Required Qualifications:\n• HS Diploma and some advanced level training.\n• U.S. Citizenship.\n• Have completed progress toward a bachelor’s degree in computer science, computer engineering, or a related field.\n• Foundational experience in an object-oriented programming language, preferably in Java, and exposure to software engineering processes.\n• Hands on programming experience through coursework and/or prior internships.\n• Strong analytical and problem-solving skills.\n• Ability to quickly adapt and learn new technologies and concepts.\n• Self-motivated, independent, detail oriented, responsible team-player.\n• Strong written and oral communication skills.\n\nDesired Qualifications:\n• 3.0 and above GPA.\n• Exposure to Agile software development processes.\n• Familiarity with web development frameworks and/or database technologies.\n• Exposure to cloud computing environments.\n\n#PeratonIntern\n\nPeraton is seeking Summer 2026 Software Engineer Interns to support our Internal Research & Development (IRAD) program which will be conducted in our Herndon, VA, West Lafayette, IN or Blacksburg, VA offices.\n\nJoin our Technology and Engineering Software Delivery Center and support exciting, advanced research projects in areas such as communications, space, cybersecurity, defense, health, and mobile. You’ll have the opportunity to work in a collaborative, supportive environment with our full-time staff, allowing you to grow your skills and your career while building experience in a variety of different projects and domains. You’ll work in an Agile software development environment supporting requirements/story development, software architecture and design, software development, and unit/component testing. You’ll also get the chance to obtain certifications in leading technologies to enhance your skills, such as Amazon Web Services.\n\nWe ask that each intern be available to work the duration of the ten weeks (June to August) and commit to working a minimum of 35-40 hours per week. This program is geared toward technical college students, actively enrolled at a four-year university, who will be rising into their junior or senior years. However, strong underclassmen may be considered if they have declared their major and have completed qualified coursework.",
    "company": "Peraton",
    "location": "Herndon, US",
    "url": "https://www.careers.peraton.com/jobs/summer-2026-software-engineer-intern-herndon-virginia-158532-jobs--cms-engineering--?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-17T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSMeISmsVcIlUm5Mt1GY6UftXtD4LblXH8q7no&s=0",
    "title": "Get Paid Up to $350 - Data Insights Intern",
    "description": "Company Overview:\n\nShare your perspective with brands and research teams quickly and conveniently from anywhere in the country. Our platform makes it easy for individuals to take part in online discussions, product evaluations, and opinion-based studies. Each project you join helps companies design better products, improve experiences, and understand what consumers truly think.\n\nRole and Responsibilities:\n• Participate in paid focus groups, market studies, and online interviews\n• Share open, thoughtful, and constructive opinions on assigned topics\n• Complete study requirements within the given timeframe\n• Collaborate with moderators and other participants in virtual sessions\n\nRequired Skills and Experience:\n• Must be 18 years of age or older and reside in the U.S.\n• Strong attention to detail and ability to follow instructions\n• Basic written and verbal communication skills in English\n• Access to a reliable internet connection and personal device\n\nPreferred Qualifications:\n• Some experience with online surveys or consumer panels is an advantage\n• Comfortable expressing opinions clearly in group discussions\n• Familiarity with video conferencing tools like Zoom or Google Meet\n\nCompensation and Rewards:\n• Earn $50–$200 per project depending on study type and duration\n• Flexible opportunities - participate at your own pace\n• Work entirely from home with no fixed schedule\n• Payments made via PayPal, mailed check, or prepaid card\n\nAbout Focus Group Panel:\n\nWe exist to make your opinions matter. At Focus Group Panel, your honest feedback fuels better ideas and smarter business decisions - and you get fairly paid for contributing to that process from wherever you are.",
    "company": "Focus Group Panel",
    "location": "Alexandria, US",
    "url": "https://justopinionjobs.com/listings/37ouepkbnw8d-c396-61e87ec3f84191-a0c9aa9a6-d4e44?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-16T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSyQM9nfVZXqQadH9XCp_VvxO0muH2C2qoSXEh2&s=0",
    "title": "Data Analyst Intern - Summer 2026",
    "description": "Data Analyst Intern - Summer 2026\n\nJob Category: Intern/Co-op\n\nTime Type: Part time\n\nMinimum Clearance Required to Start: None\n\nEmployee Type: Part-Time On-Call\n\nPercentage of Travel Required: Up to 10%\n\nType of Travel: Continental US\n• * *\n\nThe Opportunity:\nThe IMS/Metrics Data Analyst will assist the Production PAPM with schedule management and metrics analysis with a focus on utilizing data science expertise and visualization software to analyze shipyard production schedules.\n\nThis opportunity is located in our Washington D.C. office and will be hybrid, with 3 days required in office and 2 days of telework.\n\nResponsibilities:\n• Provide support to Production PAPM to evaluate most recent IMS submission from Industry.\n• Maintaining the Tableau dashboard overall is central to this monthly work\n• The emphasis is also on the data analysis and software development side of things in VBA, R, etc.\n• Participate in various meetings in support of the Production PAPM.\n• Monitor and track various Earned Value Management metrics.\n• Meet with Industry schedule team to sync on IMS updates.\n• Provide deliverables for Production Drumbeats, Tri-Annual Execution Reports (TER), Program Management Reviews (PMR), etc.\n• Ensure effective communication between technical and non-technical functions for schedule-related issues.\n• Keep management informed of key issues and changes that may impact cost or schedule.\n• Assist the PAPMs in managing their overall program schedule and milestones.\n• Maintain and update the Overall Program Schedule slide as required for the Monthly RSNF Report.\n• Create visual products as part of the data analysis process, such as the Trade-Level analysis slides, etc.\n• Provide scheduling assistance and visual products for other functional areas as required.\n\nQualifications:\n\nRequired:\n• Must be currently enrolled in an undergraduate or graduate program pursuing a Data Science, Computer Science, Statistics, Mathematics, or related degree\n• Must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future\n• Experience with data science/analysis and data visualization\n• Knowledge of Microsoft Project, Open Plan, Primavera, Tableau or other visualization software\n• Familiarity with Integrated Master Schedules and Earned Value Management\n• Proficiency in Microsoft Office applications, especially Word, Excel and Power Point.\n• Ability to communicate effectively both orally and in writing\n• Good interpersonal skills with the ability to work effectively individually and in a team environment.\n\nDesired:\n• GPA of 3.0 or above\n• Previous related experience, academic, internship, etc.\n\n-\n\n________________________________________________________________________________________\n\nWhat You Can Expect:\n\nA culture of integrity.\n\nAt CACI, we place character and innovation at the center of everything we do. As a valued team member, you’ll be part of a high-performing group dedicated to our customer’s missions and driven by a higher purpose – to ensure the safety of our nation.\n\nAn environment of trust.\n\nCACI values the unique contributions that every employee brings to our company and our customers - every day. You’ll have the autonomy to take the time you need through a unique flexible time off benefit and have access to robust learning resources to make your ambitions a reality.\n\nA focus on continuous growth.\n\nTogether, we will advance our nation's most critical missions, build on our lengthy track record of business success, and find opportunities to break new ground — in your career and in our legacy.\n\nYour potential is limitless. So is ours.\n\nLearn more about CACI here.\n\n________________________________________________________________________________________\n\nPay Range: There are a host of factors that can influence final salary including, but not limited to, geographic location, Federal Government contract labor categories and contract wage rates, relevant prior work experience, specific skills and competencies, education, and certifications. Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive compensation, benefits and learning and development opportunities. Our broad and competitive mix of benefits options is designed to support and protect employees and their families. At CACI, you will receive comprehensive benefits such as; healthcare, wellness, financial, retirement, family support, continuing education, and time off benefits. Learn more here.\n\nThe proposed salary range for this position is:\n$45,900 - $91,900\n\nCACI is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, age, national origin, disability, status as a protected veteran, or any other protected characteristic.",
    "company": "CACI",
    "location": "Washington, US",
    "url": "https://careers.caci.com/global/en/job/CACIGLOBAL318643EXTERNALENGLOBAL/Data-Analyst-Intern-Summer-2026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-15T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Data Scientist Intern",
    "description": "Description\n\nJob Description - Resources available on Prism to create your job description to not only be compliant but attractive: Purpose, Compliance & Components of Creating Requisitions, How to Write Effective Job Descriptions & Titles, Job Description Creation Best Practice Toolkit and Guidelines for Equivalency.\n\nProvide general program information and/or general position overview. Example: The [Name] Group at Leidos currently has an opening for a [Job Title] to work in our [City, State] office. This is an exciting opportunity to use your experience helping the [Contract/Program Name] mission. In this mission we…\n\nAre you passionate about solving complex problems using AI and Machine Learning? Are you excited to build cutting-edge technology and contribute to innovative research that drives real-world impact?\n\nLeidos is looking for Data Scientist Intern to join our team and contribute to Research and Development efforts spanning areas such as Natural Language Processing, Reinforcement Learning, AI Ethics, and Predictive Analytics. This is an excellent opportunity to collaborate with a multidisciplinary team of experts and make meaningful contributions to the field of AI/ML.\n\n.\n\nWe are looking for someone who is intellectually adaptive, likes to collaborate, inquisitive, and capable of conducting original science. You will work closely with junior and senior research/data scientists with expertise in information retrieval, large language models, information science, artificial intelligence, and statistics. You should be strongly experienced in Python coding and research methodologies and have knowledge of commonly used ML libraries (SciKit-learn).\n\nPrimary Responsibilities\n• Design build, train, and evaluate machine learning models across various domains.\n• Conduct original research and develop innovative solutions in areas such as Predictive Analytics, Explainable AI, and statistical modeling.\n• Collaborate with AI/ML researchers and engineers using Agile methodologies.\n• Analyze complex datasets to identify trends and inform decision-making processes.\n• Communicate findings, insights, and methodologies to both technical and non-technical stakeholders.\n• Contribute to the development of tools and technologies for deployment in real-world environments.\n• Implement appropriate modeling and data science strategies required to address customer needs\n\nBasic Qualifications\n• Must be enrolled in degree program and actively seeking a Master’s or Ph.D. degree in Computer Science, Data Science or related field\n• Strong Python programming fundamentals.\n• Experience with AI/ML tools, such as common Python packages (e.g., scikit-learn, NumPy, Pandas) and Jupyter notebooks.\n• Knowledge of machine learning algorithms, statistical modeling, and data analysis techniques.\n• Familiarity with research methodologies and practices, including experimental design and hypothesis testing.\n• Self-starter with high intellectual curiosity.\n• Strong communication skills, with the ability to explain complex technical concepts to a non-technical audience.\n\nPreferred Qualifications\n• Experience with generative AI, Large Language Models (LLMs), or transformer-based architectures.\n• Familiarity with data visualization libraries such as Plotly, Streamlit, and matplotlib.\n• Willing to learn new skills, tools, and frameworks as needed.\n• Ability and willingness to obtain a Top Secret security clearance.\n• US Citizenship is required.\n\nAt Leidos, we don’t want someone who \"fits the mold\"—we want someone who melts it down and builds something better. This is a role for the restless, the over-caffeinated, the ones who ask, “what’s next?” before the dust settles on “what’s now.”\n\nIf you’re already scheming step 20 while everyone else is still debating step 2… good. You’ll fit right in.\n\nOriginal Posting:\nOctober 16, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $55,250.00 - $99,875.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\n\n#Remote",
    "company": "Leidos",
    "location": "Herndon, US",
    "url": "https://careers.leidos.com/jobs/16927636-data-scientist-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-15T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRk2ihJ9ePBk6F-Q7Bdt7YG12s1HxIcu6k05Vys&s=0",
    "title": "Federal Data Engineering Co-Op: 2026",
    "description": "Introduction\n\nA career in IBM Consulting is rooted in long-term relationships and close collaboration with clients across the globe.\n\nYou'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio, including Software and Red Hat.\n\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. You will be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in groundbreaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nYour Role And Responsibilities\n\nDuring your co-op experience, you can enhance your knowledge and gain professional experience by working on client projects. This role provides an exceptional opportunity to build a compelling portfolio, acquire new skills, gain insights into diverse industries, and embrace novel challenges for your future career.\n\nAt IBM, we prioritize continuous learning, skill development, and personal growth within a culture of coaching and mentorship. As a co-op, you'll experience this culture and have the opportunity to advance to our associate program based on results and performance.\n\nWork Experiences You Could Be Exposed To\n• Mentored Analytical Support: Receive mentorship from diverse professionals in science engineering and consulting applying analytical rigor and statistical methods to predict behaviors.\n• Data Integrations: Develop skills in writing efficient and reusable programs to cleanse integrate and model data. Evaluate model results contributing to data-driven insights.\n• Effective Communication: Assist in conveying analytical results to both technical and non-technical audiences, refining your ability to communicate complex findings.\n• Tech-Driven Data Transformer: Utilize program languages like Python to build data pipelines, extracting and transforming data from repositories to consumers. Gain exposure to cloud platforms, ETL tools, and data integration, expanding your tech toolkit\n\nThese positions are anticipated to start in summer 2026.\n\nCandidates must have the ability to obtain and maintain a Federal Security clearance while in IBM Federal Consulting.\n\nThe below requirements are guidelines. If you have transferable skills, we encourage you to apply for this role.\n\nRequired Technical And Professional Expertise\n• Currently pursuing a quantitative degree in Computer Science, Statistics, Mathematics, Engineering, IST, or a related field.\n• Strong Interpersonal skills that enhance collaboration and relationship building, while also managing dynamic workloads in an agile environment.\n• Have initiative and passion to actively seek new knowledge and improve skills while embracing a growth mindset to assimilate diverse viewpoints.\n• Demonstrate leadership experience and ability to communicate effectively through active listening; while also be willing to adapt and have a readiness to take ownership of tasks and challenges.\n• Familiarity with one or more scripting languages (Python preferred), or a proven computer science foundation.\n• Ability to work in-office, on-site in State College, PA during the academic year.\n• Ability to work up to 20 hours per week when classes are in session (e.g., fall and spring semesters) and availability to potentially work up to 40 hours per week during academic breaks (e.g., summer).\n• Must have the ability to obtain and maintain a Federal clearance, if necessary, for your client assignment.\n\nPreferred Technical And Professional Experience\n• Demonstrate familiarity or interest in statistical analysis or data mining through previous internships, personal/academic projects, hackathons, and/or publications.\n• General familiarity with databases, data-engineering tools (SQL, spark) and cloud platforms (e.g., IBM Cloud, Azure, AWS). Experience with NLP/LLM/GenAI is a plus.\n• Experience using machine-learning/data science libraries in python (scikit-learn, SciPy, pandas, PyTorch) is a plus.",
    "company": "IBM",
    "location": "University Park, US",
    "url": "https://www.linkedin.com/jobs/view/federal-data-engineering-co-op-2026-at-ibm-4312436540?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-15T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Intern -  Data Engineer - Summer 2025",
    "description": "About Lumen\n\nLumen connects the world. We are igniting business growth by connecting people, data and applications – quickly, securely, and effortlessly. Together, we are building a culture and company from the people up – committed to teamwork, trust and transparency. People power progress.\n\nLumen’s commitment to workplace inclusion and employee support shines bright. We’ve made the Newsweek 2024 Greatest Workplaces for Diversity list and achieved a perfect score of 100 on the Human Rights Campaign Corporate Equality Index (CEI) for the fifth consecutive year. Plus, we’re the top employer in the communications and telecom industry, ranking 12th overall across all industries in The American Opportunity Index.\n\nWe’re looking for top-tier talent and offer the flexibility you need to thrive and deliver lasting impact. Join us as we digitally connect the world and shape the future.\n\nThe Role\n\nIf you're a student eager to explore the exciting world of digital innovation, Lumen is the perfect place for you. Lumen offers a fully immersive, 10-week summer internship program. Our interns demonstrate curiosity, innovation, and a passion for advancing technology. We believe that empowering our people and helping them reach their full potential is essential for the long-term success of both Lumen and our customers.\n\nProgram dates: May 30 – August 8, 2025.\n\nThe Main Responsibilities\n\nLumen’s Mass Markets organization is looking for a Data Engineer intern on our Applications Engineering team. The intern will be responsible for building machine learning models, developing data pipelines and creating innovating AI applications.\n\nOther responsibilities of intern will include:\n\nSupporting digital channel for mass markets customers\n\nResearch AI solutions to reduce cost and improve customer experience\n\nManage data pipelines\n\nWhat We Look For in a Candidate\n\nProgram eligibility is contingent on the candidate’s commitment of the entire 10-week program. No exceptions will be made.\n\nRequired qualifications\n\nEnrolled at a 4-year accredited college or university, rising senior or graduate level education status at the start of the internship\n\nGraduating August 2025 – May 2027\n\nPreferred fields include burt not limited to: – Computer Science, Business Analytics, Data Science, Information Systems.\n\nIntern must be able to work 40 hours per week during the 10-week program (May 30 – August 8, 2025)\n\nProficiency and understanding of:\n\nMS Office Suite – Excel and PowerPoint\n\nPython expertise\n\nMachine Learning frameworks ( TensorFlow, PyTorch, scikit-learn) models\n\nPython libraries ( NumPy, Pandas, Matplotlib, Seaborn etc…)\n\nCloud platforms like GCP\n\nReact.Js\n\nNode.Js\n\nPreferred qualifications\n\nAnalytical Skills: Ability to analyze and interpret data to provide actionable insights\n\nExperience with statistical analysis and data visualization tools is a plus.\n\nAttention to detail and a proactive approach to learning and development.\n\nAbility to translate technical information into non-technical terms\n\nStrong problem-solving abilities to identify and resolve issues related to data accuracy, report performance, and user requirements\n\nEagerness to learn and adapt to new technologies and methodologies.\n\nStrong organization skills\n\nAbility to multitask while working in fast paced environment\n\nCompensation\n\nInternship compensation ranges depend on each individual’s level of education, geographic location, and experience/qualifications aligned to the role.\n\nHourly Based Pay Range:\n\nMin: $26.00/hour\n\nMax: $43.00/hour\n\nWhat to Expect Next\n\nAfter completion and submission of your application, you will be asked to participate in a virtual video interview. This on demand interview will be a way for Lumen to learn more about you and your experience as it aligns to the internship position. A separate email invitation will be sent to you (check your spam) within 6 hours of application. For continued consideration in the summer internship program, please ensure you complete the video interview within 5 business days of application.\n\nApplication & Interview Timeline:\n\nOctober – First Round Interviews with top, qualified candidates\n\nNovember - Interview panel with work team\n\nDecember - All Summer 2025 offers will be extended by end of month\n\nRequisition #: 335207\n\nBackground Screening\n\nIf you are selected for a position, there will be a background screen, which may include checks for criminal records and/or motor vehicle reports and/or drug screening, depending on the position requirements. For more information on these checks, please refer to the Post Offer section of our FAQ page (https://jobs.lumen.com/global/en/faq) . Job-related concerns identified during the background screening may disqualify you from the new position or your current role. Background results will be evaluated on a case-by-case basis.\n\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nEqual Employment Opportunities\n\nWe are committed to providing equal employment opportunities to all persons regardless of race, color, ancestry, citizenship, national origin, religion, veteran status, disability, genetic characteristic or information, age, gender, sexual orientation, gender identity, gender expression, marital status, family status, pregnancy, or other legally protected status (collectively, “protected statuses”). We do not tolerate unlawful discrimination in any employment decisions, including recruiting, hiring, compensation, promotion, benefits, discipline, termination, job assignments or training.\n\nDisclaimer\n\nThe job responsibilities described above indicate the general nature and level of work performed by employees within this classification. It is not intended to include a comprehensive inventory of all duties and responsibilities for this job. Job duties and responsibilities are subject to change based on evolving business needs and conditions.\n\nSalary Range\n\nSalary Min :\n\n26\n\nSalary Max :\n\n43\n\nThis information reflects the anticipated base salary range for this position based on current national data. Minimums and maximums may vary based on location. Individual pay is based on skills, experience and other relevant factors.\n\nThis position is eligible for either short-term incentives or sales compensation. Director and VP positions also are eligible for long-term incentive. To learn more about our bonus structure, you can view additional information here. (https://jobs.lumen.com/global/en/compensation-information) We're able to answer any additional questions you may have as you move through the selection process.\n\nAs part of our comprehensive benefits package, Lumen offers a broad range of Health, Life, Voluntary Lifestyle and other benefits and perks that enhance your physical, mental, emotional and financial wellbeing. You can learn more by clicking here. (https://centurylinkbenefits.com)\n\nPlease be advised that Lumen does not require any form of payment from job applicants during the recruitment process. All legitimate job openings will be posted on our official website or communicated through official company email addresses. If you encounter any job offers that request payment in exchange for employment at Lumen, they are not for employment with us, but may relate to another company with a similar name.\n\nNote: For union-represented postings, wage rates and ranges are governed by applicable collective bargaining agreement provisions.\n\nApplication Deadline\n\n10/31/2024",
    "company": "Lumen",
    "location": "Annapolis, US",
    "url": "https://www.zettlor.com/job-posts/c1a01f1e-88ac-4ef5-b827-ab47ec856a5e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-15T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0EfPVHF5N0I08Ioa1WKZDYxcfrJkurRgwcHI5&s=0",
    "title": "Data Engineering Intern",
    "description": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for Siemens. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nJob Family: Brightly Software\n\nReq ID: 481268\n\nWho We Are\n\nBuild a brighter future while learning and growing with a Siemens company at the intersection of technology, community and sustainability. Our global team of innovators is always looking to create meaningful solutions to some of the toughest challenges facing our world. Find out how far your passion can take you.\n\nAbout The Job\n\nAs a Data Engineer Intern, you will play a hands-on role in building and optimizing data solutions that drive real business impact. You’ll work collaboratively with senior data engineers, data scientists, and analysts to design, develop, and maintain data pipelines and processes. Your projects will span from ingesting and transforming data from diverse sources to ensuring data quality and integrity across our systems.\n\nWhat You Will Do\n\nAs a Data Engineer Intern, you will have the opportunity to:\n• Assist in Data Pipeline Development: Contribute to the design, development, and maintenance of ETL/ELT processes to ingest, transform, and load data from various sources into our data warehouse/data lake.\n• Write and Optimize SQL Queries: Develop and optimize SQL queries for data extraction, transformation, and analysis.\n• Develop Python Scripts: Write Python scripts to automate data-related tasks, perform data cleaning, and implement data transformations.\n• Support Data Quality Initiatives: Help monitor data pipelines for data quality issues, troubleshoot errors, and ensure data integrity.\n• Document Data Processes: Assist in creating and maintaining documentation for data pipelines, data models, and data dictionaries.\n• Collaborate with the Team: Work closely with senior data engineers, data scientists, and analysts to understand data requirements and deliver reliable data solutions.\n• Learn New Technologies: Actively participate in learning new data engineering tools and technologies, including cloud platforms, big data frameworks, and orchestration tools.\n• Troubleshoot Issues: Aid in identifying and resolving issues related to data processing and infrastructure.\n\nThis internship is designed for those eager to learn, adapt to new technologies, and make meaningful contributions to both the team and the organization.\n\nWhat You Need\n• Currently pursuing a Bachelor's in Computer Science, Engineering, Data Science, Mathematics, Statistics, or a related technical field.\n• Strong foundational understanding of relational databases and SQL.\n• Proficiency in at least one programming language, preferably Python.\n• Basic understanding of data warehousing concepts.\n• Excellent problem-solving skills and a keen eye for detail.\n• Strong communication and teamwork abilities.\n• Eagerness to learn and adapt to new technologies and challenges.\n\nWhat makes you a Standout\n• Familiarity with cloud platforms such as AWS or Azure Cloud Platform (e.g., S3, Redshift, BigQuery, Data Factory, Glue) and Snowflake.\n• Exposure to data integration (ETL/ELT) development using multiple languages (e.g., Java, Scala, Python, PySpark, SparkSQL)\n• Experience with data orchestration tools (e.g., Apache Airflow, Prefect).\n• Basic knowledge of data modeling techniques.\n• Experience with version control systems (e.g., Git Bitbucket).\n• Personal projects or coursework demonstrating an interest in data engineering or data science.\n\nThe Brightly culture\n\nWe’re guided by a vision of community that serves the ambitions and wellbeing of all people, and our professional communities are no exception. We model that ideal every day by being supportive, collaborative partners to one another, conscientiously making space for our colleagues to grow and thrive. Our passionate team is driven to create a future where smarter infrastructure protects the environments that shape and connect us all. That brighter future starts with us.\n\nOur Commitment to Equity and Inclusion in our Diverse Global Workforce:\n\nWe value your unique identity and perspective. We are fully committed to providing equitable opportunities and building a workplace that reflects the diversity of society, while ensuring that we attract the best talent based on qualifications, skills, and experiences. We welcome you to bring your authentic self and transform the every day with us.\n\nBrightly maintains a Drug Free workplace in accordance with applicable law.\n\nQualified Applicants must be legally authorized for employment in the United States. Qualified Applicants will not require employer sponsored work authorization now or in the future for employment in the United States.\n\n28.00\n\nOrganization: Smart Infrastructure\n\nJob Type: Full-time\n\nCategory: Internal Services\n\nIf you have questions about this posting, please contact support@lensa.com",
    "company": "Lensa",
    "location": "Raleigh, US",
    "url": "https://www.linkedin.com/jobs/view/data-engineering-intern-at-lensa-4312496412?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-15T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAMVnHFh_IbJak2Lg1O20HiBAQLWyrLUX3E3L6&s=0",
    "title": "Intern - Data Analytics (Finance) Available Summer 2026",
    "description": "Intern – Data Analytics (Finance)\n\nCLASSIFICATION: Non-exempt\n\nREPORTS TO: Data Analytics Director\n\nDATE: September 30, 2025\n\nJOB DESCRIPTION\n\nSummary/Objective\n\nData Analytics Summer Intern needed to support the Finance team with data-driven analysis. This internship offers a hands-on opportunity to apply coding, statistical, and visualization skills to solve real-world banking challenges. Working closely with Finance leaders, the intern will help enhance reporting capabilities, streamline data processes, and provide insights that drive strategic and financial decision-making.\n\nEssential Functions\n• Query, clean, and transform large datasets using SQL, Python, or R\n• Build dashboards and visualizations (Power BI or similar) to monitor and communicate key performance metrics\n• Develop and automate reporting solutions to improve efficiency and accuracy in reporting processes\n• Present technical findings in a clear, business-oriented way to stakeholders\n\nSkills/Abilities\n• Proficiency in at least one programming language (SQL, Python, or R required)\n• Detail-oriented, proactive, and eager to solve problems with data\n• Familiarity with statistical methods and applied analytics in business contexts\n• Strong communication skills, with the ability to simplify complex data for non-technical stakeholders\n• Understanding of banking a plus\n\nSupervisory Responsibility\n\nThis position does not have supervisory responsibilities.\n\nWork Environment\n\nThis job operates in an office setting, the opportunity to telework is not available. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. Office environment with job duties conducted via telephone, face to face meetings, and on the computer.\n\nPhysical Demands\n\nThis position requires manual dexterity, the ability to lift computers, network equipment, files and open cabinets. This position requires bending, stooping or standing as necessary.\n\nTravel\n\nNo travel required for this position.\n\nEducation and Experience\n• Currently enrolled in a Bachelor’s program in Data Analytics, Computer Science, Finance, or a related field.\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nEqual Employment Opportunity/M/F/disability/protected veteran status\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nInclude shift schedule\n\nNot Included\n\nInclude budgeted hours\n\nNot Included",
    "company": "Burke & Herbert Bank & Trust",
    "location": "Alexandria, US",
    "url": "https://www.indeed.com/viewjob?jk=cbc0795f2d3a8552&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-14T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTVflbuT8YaCAfRWZOpR7llawDGlnHVIwTrp9AU&s=0",
    "title": "Intern - Data Privacy (Summer 2026)",
    "description": "Company\nAlaska Airlines\n\nThe Team\n\nInterns at Alaska Airlines, Hawaiian Airlines & Horizon Air join teams throughout different departments and work on visible projects that impact our guests and business. Beyond hands-on experience, interns also get the opportunity to network with fellow employees and company leaders through various intern events and programming. Our interns also receive unlimited standby travel benefits during their internship, which means that many weekends are filled with jet setting across our growing network.\n\nThis internship is for summer 2026. Our internships are full-time for 12 weeks, and we offer two program timelines to align with different academic calendars.\n\nThis internship will be located in SeaTac, WA. If not already in the internship city, candidates will be required to relocate for the duration of the internship.\n\nRole Summary\n\nBecome part of a dynamic environment that offers a hands-on internship experience. We are looking for talented and enthusiastic students to contribute toward key projects that support our business, community and cultural growth. Experience a work environment that thrives on innovation, collaboration and partnership.\n\nKey Duties\n• Engage with and gather data from business units to develop and maintain a data processing inventory.\n• Conduct data protection impact assessments and/or privacy impact assessments.\n• Develop training and awareness events with clear learning objectives and outcomes in partnership with the Data Privacy Program Manager and AAG Learning Managers.\n• Manage internal inquiries and requests and provide timely privacy advice for projects and various AAG initiatives based on Data Privacy's knowledgebase.\n• Assist with developing and maintaining internal privacy communications, newsletters, reports and website content.\n\nJob-Specific Experience, Education & Skills\n\nRequired\n• Working toward a Bachelor’s degree with a focus in data management, information technology, information security and privacy.\n• Strong interpersonal and organizational skills.\n• Strong oral and written communication skills.\n• Ability to self-organize, manage work, and track and maintain work in Azure DevOps, privacy program management solutions, and SharePoint.\n• Currently enrolled in an undergraduate program and have at least one semester or quarter of school remaining after the internship.\n• Must have achieved a junior or higher academic standing at the time of application\n• High school diploma or equivalent.\n• Minimum age of 18.\n• Must be authorized to work in the U.S.\n\nPreferred\n• Understanding of data privacy regulations (ie: GDPR, CCPA)\n\nJob-Specific Leadership Expectations\n\nEmbody our values to own safety, do the right thing, be caring and kind, and deliver performance.\n\nStarting Rate\nUSD $30.00/Hr.\n\nBonus\n\nTotal Rewards\n\nAlaska Airlines, Hawaiian Airlines and Horizon Air pay and benefits can vary by company, location, number of regularly scheduled hours worked, length of employment, and employment status.\n• Free stand-by travel privileges on Alaska Airlines, Hawaiian Airlines & Horizon Air (flight processing fee may apply depending on the company being hired into and the airline being booked)\n• Travel benefits begin on day one\n• Up to six employee choice travel credits\n\nRegulatory Information\n\nEqual Employment Opportunity Policy Statement\n\nIt is the policy of Alaska Airlines, Hawaiian Airlines and Horizon Air to comply with all applicable federal, state and local laws governing nondiscrimination in employment and to ensure equal opportunity in all terms, conditions, and benefits of employment or potential employment.\n\nWe also prohibit discrimination and harassment against any employee or applicant for employment because of race, color, religion, sex, national origin, age, disability, veteran status, genetic information and other legally protected categories.\n\nWe have established an EEO Compliance Program under Section 503 of the Rehabilitation Act of 1973 (“Section 503”) and the Vietnam Era Veteran’s Readjustment Assistance Act of 1974 (“VEVRAA”). All applicants and employees are treated without regard to their race, color, religion, sex, national origin, disability or protected veteran status. In addition, we have established an audit and reporting system to allow for effective measurement of its equal employment opportunity activities.\n\nTo implement this policy, we will:\n\n(1) Recruit, hire, train and promote qualified persons in all job titles, without regard to race, color, religion, sex, national origin, age, disability, veteran status, genetic information and any other legally protected categories; (2) Ensure that employment decisions are based only on valid job requirements; and (3) Ensure that all personnel actions and employment activities such as compensation, benefits, promotions, layoffs, return from layoff, Alaska Airlines, Hawaiian Airlines and Horizon Air sponsored programs, and tuition assistance will be administered without regard to race, color, religion, sex, national origin, age, disability, veteran status, genetic information and other legally protected categories.\n\nEmployees and applicants for employment will not be subjected to harassment, intimidation, threats, coercion or discrimination because they have engaged or may engage in (1) filing a complaint, (2) opposing any act or practice made unlawful by, or exercising any other right protected by, any Federal, State or local law requiring equal opportunity, including Section 503 and the equal opportunity provisions of VEVRAA, or (3) assisting or participating in any investigation, compliance evaluation, hearing, or any other activity related to the administration of any Federal, State or local law requiring equal opportunity, including Section 503 and the equal opportunity provisions of VEVRAA.\n\nGovernment Contractor & Department of Transportation (DOT) Regulations Alaska Airlines, Hawaiian Airlines & Horizon Air are regulated by the Department of Transportation (DOT – regulations, 49 CFR part 40) and all applicants are advised that post-offer and/or pre-employment drug testing will be conducted to determine the presence of marijuana, cocaine, opioids, phencyclidine (PCP) and amphetamines or a metabolite of these drugs prior to any offer or employment or transfer into a safety-sensitive position. Failure to submit to testing or positive indications of drug use will render the applicant ineligible for employment with Alaska Airlines/Hawaiian Airlines/Horizon Air and any employment offer will be withdrawn.\n\nApply by 7:00 PM Pacific Time on\n10/30/2025\n\nFLSA Status\nNon-Exempt\n\nEmployment Type\nFull-Time\n\nRegular/Temporary\nTemporary/OC\n\nRequisition Type\nIntern\n\nLocation\nSeattle - Hub\n\nA:\nY - T1",
    "company": "Alaska Airlines",
    "location": "Washington, US",
    "url": "https://www.recruit.net/job/data-privacy-summer-jobs/ABB02C08AE13C7A7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-14T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSY67fzjmnnDara9jxrZpXlGurXnhzYNFeqZzAd&s=0",
    "title": "Co-op-Data Engineer-Reedsville, PA-January-June 2025",
    "description": "Job Title\nCo-op-Data Engineer-Reedsville, PA-January-June 2025\n\nJob Description\n\nAre you interested in an co-op opportunity with Philips? We welcome individuals who are currently pursuing an undergraduate (BS) degree to participate in 6 month co-op opportunities at our site in Reedsville, PA Through this role you will gain meaningful, hands-on experience working for a HealthTech company.\n• Supporting the R&D Reliability team by developing data engineering tools and support R&D with improvements\n• Data analysis and reporting. Lead or support project teams as needed\n• Support CONQ database transition and improvements. Migrate data and write new scripts to allow the transducer reliability team to have the data they need consistently.\n\nYou're the right fit if:\n• Pursuing a Bachelor's degree in one of the following areas of study: Data Science, Data Analytics, Electrical Engineering, Computer Science\n• Experience with T-SQL, Python, SAP, Microsoft Power Apps, SAP-ME, Object Oriented Programming Problem-solving methodology (i.e., Shainin Red-X, DMAIC, PDCA), manufacturing process knowledge,\n• Experience with a regulated work environment, Project Management Self-starter, Driven to improve, Big picture thinking, Takes initiative.\n• You must be able to successfully perform the following minimum Physical, Cognitive and Environmental job requirements with or without accommodation for this position.\n\nHow we work together\n\nWe believe that we are better together than apart. For our office-based teams, this means working in-person at least 3 days per week. Onsite roles require full-time presence in the company’s facilities. Field roles are most effectively done outside of the company’s main facilities, generally at the customers’ or suppliers’ locations.\n\nThis is an office role\n\nAbout Philips\n\nWe are a health technology company. We built our entire company around the belief that every human matters, and we won't stop until everybody everywhere has access to the quality healthcare that we all deserve. Do the work of your life to help improve the lives of others.\n• Learn more about our business.\n• Discover our rich and exciting history.\n• Learn more about our purpose.\n• Learn more about our culture.\n\nPhilips Transparency Details\n\nThe hourly pay range for this position is $25.00 to $29.00, plus overtime eligible. The actual base pay offered may vary within the posted ranges depending on multiple factors including job-related knowledge/skills, experience, business needs, geographical location, and internal equity.  \n\nDetails about our benefits can be found here.\n\nAt Philips, it is not typical for an individual to be hired at or near the top end of the range for their role and compensation decisions are dependent upon the facts and circumstances of each case.\n\nAdditional Information\n\nUS work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa, now or in the future.\n\nCompany relocation benefits will not be provided for this position. For this position, you must reside in or within commuting distance to Reedsville.\n\nThis requisition is expected to stay active for 45 days but may close earlier if a successful candidate is selected or business necessity dictates. Interested candidates are encouraged to apply as soon as possible to ensure consideration.\n\nPhilips is an Equal Employment and Opportunity Employer including Disability/Vets and maintains a drug-free workplace.",
    "company": "Philips",
    "location": "Reedsville, US",
    "url": "https://www.careers.philips.com/na/en/job/565943/Co-op-Data-Engineer-Reedsville-PA-January-June-2025?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-14T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQlT1GN0P19iiLhGQOyPsbf_XoDga_jDWenSusF&s=0",
    "title": "Intern - Data Science, Distributed Intelligence (Summer 2026)",
    "description": "Itron is innovating new ways for utilities and cities to manage energy and water. We create a more resourceful world to protect essential resources for today and tomorrow. Join us.\n\nThe Distributed Intelligence (DI) team is looking for a 2026 summer intern. DI from Itron helps utilities achieve a new level of distribution system visibility by combining granular data from the grid’s edge with an open-enterprise application platform. Your work will help Itron push the boundaries on grid optimization, asset management, DER integration and customer engagement.\n\nDuration\n\n40 hours per week, for 10 weeks during summer 2026. The target start is May/June, and the internship concludes August/September, depending on student academic schedule.\n\nDuties & Responsibilities\n• Data Preparation: Clean and prepare moderate- to large-sized datasets (10s to 100s of GB) for analysis, algorithm development, and production purposes\n• Data Analysis: Collaborate with senior team members and subject matter experts on exploratory data analysis (EDA) and clearly communicate the findings to relevant stakeholders\n• Algorithm Research: Support the development and refinement of new Machine Learning models under the guidance of senior team members\n• Engineering: Maintain and build data and/or production ML pipelines\n• Collaborate with data scientists, software engineers, product line managers and stakeholders\n\nRequired Skills & Experience\n• Education: Enrolled in a related accredited bachelor's degree program (preference: STEM degree, statistics, data science, software engineering etc.) with completion of at least two years of college courses\n• Intermediate experience with SQL and Python\n• Experience with statistical methods and data analysis\n• Exposure to machine learning via classes, independent projects, or work experience\n• Professional workplace communication skills\n\nPreferred Skills & Experience\n• Related internship or work experience\n• Experience working with AWS or Azure\n• Enrolled in a related master’s degree program (preference: STEM degree, statistics, data science, software engineering etc.)\n• Familiarity with Machine learning libraries like scikit-learn and XGBoost\n\nTravel: 0-10%\n\nPhysical Demands\n\nThis is a typical office job, with no special physical requirements or unusual work environment.\n\nThis position will be tied to our Liberty Lake, WA location with hybrid work flexibility of 1-3 days on-site per week.\n\nLiberty Lake, WA: $15.87 - $44.23 per hour\n\n#LI-LC1\n\nItron is committed to building an inclusive and diverse workforce and providing an authentic workplace experience for all employees. If you are excited about this role but your past experiences don't perfectly align with every requirement, we encourage you to apply anyway. In the end, you may be just who we are looking for!\nThe successful candidate's starting wage will be determined based on permissible, non-discriminatory factors such as skills and experience.\nItron is proud to be an Equal Opportunity Employer. If you require an accommodation to apply, please contact a recruiting representative at 1-800-635-5461 or email Accessibility@itron.com.\n\nItron is transforming how the world manages energy, water and city services. Our trusted intelligent infrastructure solutions help utilities and cities improve efficiency, build resilience and deliver safe, reliable and affordable service. With edge intelligence, we connect people, data insights and devices so communities can better manage the essential resources they rely on to live. Join us as we create a more resourceful world: www.itron.com",
    "company": "Itron, Inc.",
    "location": "Washington, US",
    "url": "https://www.recruit.net/job/data-science-distributed-intelligence-summer-jobs/F045C1FF46355B8B?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-13T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "2026 Summer Intern, Data Science",
    "description": "Description\n\nReady to make a difference? \n\nWe are seeking a motivated Data Scientist intern to join our Energy Analytics team. In this role, you will support client-facing projects that accelerate the transition to a smarter, cleaner electric grid. You’ll work across the full data pipeline—from engineering and analysis to visualization—while engaging directly with project managers to implement high-impact solutions in distributed energy resources (DER), electric vehicle (EV) integration, and load flexibility.\n\nThis is an entry-level, 10-week, full time internship that begins in early June 2026. Work will be remote from the United States. Pay is expected to be $28 per hour. At this time, relocation nor housing assistance is available for this position. \n\nWhat you will be doing: \n• Support client projects across energy, electrification, and DER domains through:\n• Data Engineering: Design and implement scalable data pipelines to ingest, clean, and transform large datasets using Python, SQL, and Databricks\n• Data Science & Analytics: Conduct exploratory data analysis to uncover trends and patterns, develop predictive models and machine learning solutions that drive actionable insights, and build AI-powered agents to optimize decision-making in energy systems\n• Data Visualization: Create intuitive, high-impact dashboards and reports in Power BI and Microsoft Fabric to effectively communicate insights and support data-driven decisions\n• Attend regular stakeholder meetings and collaborate with project managers to understand goals, manage timelines, and incorporate feedback\n• Translate client requirements into well-structured analytics tasks and deliverables\n• Write clean, maintainable, and well-documented code while optimizing workflows for performance and scalability\n• Manage and prioritize a diverse set of technical assignments across multiple projects\n• Work with cross-functional teams including data engineers, scientists, and policy experts to ensure high-quality client deliverables\n• Stay up to date on tools, trends, and best practices in energy analytics and visualization\n\nBasic Qualifications: \n• By start date, acceptance/ enrollment verification, or at least 9 credit hours of completed graduate-level courses in Data Science, Computer Science, Engineering, Statistics, or a related field\n• A completed bachelor’s degree \n• Candidate must be a US citizen, reside in the U.S., be authorized to work in the U.S., and all work must be performed in the U.S. per contract requirements\n\nPreferred Qualifications:\n• Proficiency in Python and SQL\n• Hands-on experience using Python Pandas for data manipulation and NumPy for numerical computing\n• Ability to write clean, maintainable code and collaborate in cross-functional teams\n• Excellent communication and organizational skills to support client meetings and deliverables\n• Effective time management and ability to adapt to changing priorities\n• Experience working in cloud environments such as Azure, AWS, or Google Cloud Platform, including deploying and managing data workflows\n• Proficiency in using Databricks for scalable data processing, analytics, and collaborative development\n• Familiarity with large-scale data analytics frameworks like Apache PySpark for distributed computing and big data processing\n• Understanding of AI/ML concepts, including model development and building intelligent agents to solve complex problems\n• Experience designing and building interactive dashboards and reports using Power BI to visualize complex data and support decision-making\n• Experience working with and supporting Agile development teams\n• Ability to learn quickly, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT technology space\n• The ability to work closely with and explain technical concepts/solutions to non-technical client stakeholders\n\nWorking at ICF\nICF is a global advisory and technology services provider, but we’re not your typical consultants. We combine unmatched expertise with cutting-edge technology to help clients solve their most complex challenges, navigate change, and shape the future.\n\nWe can only solve the world's toughest challenges by building a workplace that allows everyone to thrive. We are an equal opportunity employer. Together, our employees are empowered to share their expertise and collaborate with others to achieve personal and professional goals. For more information, please read our EEO policy.\n\nWe will consider for employment qualified applicants with arrest and conviction records.\n\nReasonable Accommodations are available, including, but not limited to, for disabled veterans, individuals with disabilities, and individuals with sincerely held religious beliefs, in all phases of the application and employment process. To request an accommodation, please email Candidateaccommodation@icf.com and we will be happy to assist. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. \n\nRead more about workplace discrimination rights or our benefit offerings which are included in the Transparency in (Benefits) Coverage Act.\n\nCandidate AI Usage Policy\n\nAt ICF, we are committed to ensuring a fair interview process for all candidates based on their own skills and knowledge. As part of this commitment, the use of artificial intelligence (AI) tools to generate or assist with responses during interviews (whether in-person or virtual) is not permitted. This policy is in place to maintain the integrity and authenticity of the interview process. \n\nHowever, we understand that some candidates may require accommodation that involves the use of AI. If such an accommodation is needed, candidates are instructed to contact us in advance at candidateaccommodation@icf.com. We are dedicated to providing the necessary support to ensure that all candidates have an equal opportunity to succeed.  \n\nPay Range - There are multiple factors that are considered in determining final pay for a position, including, but not limited to, relevant work experience, skills, certifications and competencies that align to the specified role, geographic location, education and certifications as well as contract provisions regarding labor categories that are specific to the position.\n\nThe pay range for this position based on full-time employment is:\n$41,614.00 - $70,744.00\n\nNationwide Remote Office (US99)",
    "company": "IIIIIIUS",
    "location": "Reston, US",
    "url": "https://careers.icf.com/us/en/job/R2502884/2026-Summer-Intern-Data-Science?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-13T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Software Engineer Intern",
    "description": "Description\n\nThe Digital Modernization Group at Leidos is looking for interns to start work in summer 2026. We currently have an opening for a Software Engineering intern for the Global Solutions Management – Operations II (GSM-O II) contract. This contract includes the Operations, Sustainment, Maintenance, Repair and Defense of the Defense Information System Network (DISN) within the DOD Information Network (DODIN) in support of the Defense Information Systems Agency (DISA). This role is primarily remote, but candidates must be within commuting distance to Ft Meade, MD for on-site support.\n\nLeidos is a worldwide defense, intelligence, homeland security and advanced technology company. Our program GSM-O is a United States Government program chartered to provide worldwide Defense Information System Network services to the Department of Defense and national security organizations.\n\nWe are looking for highly motivated, driven, capable candidates to join our GSM-O team! The Special Projects/Innovations Team is looking for qualified interns with the focus on supporting software development.\n\nPrimary Responsibilities:\n• Design, develop, document, test and deploy software written in Python, JavaScript, Java and SQL.\n• Create Kibana visualizations and dashboards using React to provide information to users and support staff.\n• Develop Kafka system integrations between Elasticsearch/Logstash and other systems.\n• Develop robotic process automation (RPA) bots.\n• Assist with the deployment, configuration, testing, troubleshooting, maintenance, updates/upgrades of Kafka and Elastic clusters and environments.\n• Develop automated tests using Ansible, Selenium, JMeter, Junit and/or other applicable tools.\n• Develop automated CI/CD build/deployment pipelines using Jenkins, Artifactory, Kubernetes, Docker, Ansible and Bitbucket.\n• Work with an Agile team, attend daily scrums and demonstrate working software while collaborating with a geographically distributed (remote) team.\n• Troubleshoot and resolve installation, infrastructure and system issues.\n• Proactively and independently identify, report, monitor, and mitigate technical risks.\n• Frequently communicate and collaborate with other team members to ensure successful completion of project objectives.\n\nBasic Qualifications:\n• Actively pursuing a degree from accredited college/university in a relevant discipline.\n• Software development experience with Python, Java and SQL. Working knowledge of HTML and JavaScript.\n• Experience with distributed version control software such as Git and Bitbucket.\n• Knowledge of and ability to apply principles, theories, and concepts of Software Engineering.\n• Experience developing software on a UNIX command line platform.\n• Strong communication skills that enable proactive and effective collaboration with a virtual team.\n• Ability to obtain interim Secret DoD Security clearance prior to start date (selected candidates will be sponsored for required clearance) and US citizenship required.\n• Ability to obtain Security+ certification or equivalent DoD 8570 IAT II certification.\n\nPreferred Qualifications:\n• Web development experience, specifically using HTML, JavaScript and UI frameworks such as React.\n• Experience working remotely with a geographically dispersed team.\n• Full software lifecycle experience (design, development, test, deployment), including deployment to a production environment.\n• Experience developing software in a containerized environment with Kubernetes and/or Docker.\n• Experience designing, building and deploying DevOps pipelines with Bitbucket, Git, Jenkins, Artifactory and Ansible (or equivalent tools).\n• Experience designing, developing and deploying software in a cloud environment (AWS is a plus).\n• Experience with Atlassian tools, including JIRA and Confluence.\n• Familiarity with Artificial Intelligence (AI) tools and concepts (large language models, predictive analytics, or automation frameworks) to support development of self-healing, auto-ticketing, and recommendation capabilities for DISN network operations.\n\nCome break things (in a good way). Then build them smarter.\n\nWe're the tech company everyone calls when things get weird. We don’t wear capes (they’re a safety hazard), but we do solve high-stakes problems with code, caffeine, and a healthy disregard for “how it’s always been done.”\n\nOriginal Posting:\nOctober 14, 2025\n\nFor U.S. Positions: While subject to change based on business needs, Leidos reasonably anticipates that this job requisition will remain open for at least 3 days with an anticipated close date of no earlier than 3 days after the original posting date as listed above.\n\nPay Range:\nPay Range $46,800.00 - $84,600.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
    "company": "Leidos",
    "location": "Odenton, US",
    "url": "https://careers.leidos.com/jobs/16918738-software-engineer-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-13T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Data Engineer Intern (12-Week Internship Summer 2026)",
    "description": "Requirements\n• We're looking for someone who demonstrates clear communication, a strong drive to execute, and excellent craftsmanship,\n• Experience or coursework in programming, preferably in Python, with a strong understanding of data structures and algorithms,\n• Understanding of data analysis and database concepts, with experience using SQL,\n• Familiarity with or strong interest in AI, LLMs, and API integrations,\n• Understanding of software architecture principles and a keen interest in furthering this knowledge (in microservices, distributed systems, cloud-native design, etc.),\n• An embodiment of our core cultural values: clear communication, positive energy, continuous learning, and efficient execution,\n• (Desirable) Currently pursuing a degree or certificate in Computer Science, Data Engineering, or a related discipline,\n• (Desirable) Exposure to cloud platforms (e.g., AWS, GCP, Azure),\n• (Desirable) Eagerness to delve into complex data challenges and contribute to innovative solutions\n\nWhat the job involves\n• This is a 12-week internship during summer 2026,\n• As a Data Engineer Intern on the Strategy, Execution, & Analytics team, you'll collaborate closely with business partners in product and engineering to identify key opportunities and ensure accurate data interpretation,\n• You'll also work with the analytics engineering team to build scalable analytics models and systems that broaden insights across the company and within our products,\n• Collaborate with analytics engineering to design and implement robust data pipelines, ensuring data integrity and accessibility for analytical and machine learning initiatives,\n• Assist in the development and maintenance of scalable data infrastructure, leveraging Python and cloud-based technologies,\n• Support senior engineers in integrating and managing data from various sources, including APIs,\n• Contribute to the implementation of LLM frameworks, focusing on efficient data flow and state machines,\n• Participate in analytical deep dives alongside senior team members to understand and address complex business problems, clearly communicating findings,\n• Learn and apply best practices in data engineering, including data governance, security, and performance optimization",
    "company": "Coinbase",
    "location": "New York, US",
    "url": "https://app.otta.com/jobs/o0pxjmxM?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-13T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIe92y9Jsx31dkAUX2FcvtOBbCZKDNzoCX5Ns8&s=0",
    "title": "Data Engineering Internship at Castleton Commodities International Stamford, CT",
    "description": "Data Engineering Internship job at Castleton Commodities International. Stamford, CT.\n\nApplication Deadline: September 14th, 11:59m EST\n\nProgram Overview Video\n\nCastleton Commodities International is a leading global energy commodities merchant and infrastructure asset investor. As a trader, CCI deploys capital on a proprietary basis in the physical and financial commodity markets, providing the Company with market insights and access. As a strategic investor and developer, CCI leverages its market expertise, operations capabilities, and industry knowledge to invest in, and develop, select commodity infrastructure assets. Our strategically integrated platform has generated strong risk-adjusted returns for our investors since our formation.\n\nPosition Overview:\n\nCCI is developing a leading-edge Data Science platform, as staying at the forefront of data management and analytics is essential to our investment strategy. We are looking for a motivated and detail-oriented Data Engineering Intern to join our Global Data Science & Technology team in our Houston, TX or Stamford, CT office. The Data Engineering Intern will work closely with our Data Science, Data Engineering and Commercial teams to build and optimize data pipelines that power our analytics, forecasting, and investment decision-making processes. This is a hands-on technical internship ideal for someone who enjoys solving real-world data challenges, especially around ingesting, scraping, and managing large datasets across the commodity markets.\n\nResponsibilities:\n• Develop and maintain robust data ingestion pipelines from various internal and external sources, including APIs, FTP endpoints, and cloud data providers.\n• Develop data ingestion and transformation pipelines using Python and SQL, publishing Snowflake for downstream use in analytics and forecasting tools.\n• Work on data architecture and data management projects for both new and existing data sources.\n• Design and implement ETL processes to clean, normalize, and store structured and semi-structured data in Snowflake, our core relational data warehouse.\n• Analyze data pipeline performance and implement optimizations to improve efficiency and reliability.\n• Conduct data quality checks and build validation logic to identify anomalies and ensure data integrity for use by commercial trading and analytics teams.\n• Automate data workflows using Python, SQL, and orchestration tools (e.g., Airflow or similar).\n• Assist in transitioning legacy datasets and codebases into scalable, cloud-native workflows aligned with our modern data architecture.\n• Document data sources, pipeline logic, and data models to ensure maintainability and knowledge transfer.\n\nQualifications:\n• Currently pursuing a Bachelor’s or higher degree in Computer Science, Engineering, Management Information Systems, or related technical field.\n• Expected graduation date of Winter 2026 or Spring/Summer 2027.\n• Strong programming experience in Python (preferred libraries: pandas, NumPy, SQL alchemy, etc.).\n• Strong understanding of SQL and experience querying relational databases (Snowflake a plus).\n• Exposure to or interest in cloud platforms (e.g., AWS, Azure), particularly with cloud data storage and compute.\n• Familiarity with web scraping frameworks and handling large-scale structured and unstructured data sources.\n\nVisit to learn more!",
    "company": "Castleton Commodities International",
    "location": "Stamford, US",
    "url": "https://tejcivilsedtech.com/job-library/job/data-engineering-internship-at-castleton-commodities-international-stamford-ct-MHB5S2QzUysyREJmTzNQR1lkSVFJSFBDVVE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-13T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0EfPVHF5N0I08Ioa1WKZDYxcfrJkurRgwcHI5&s=0",
    "title": "Data Analyst Intern",
    "description": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for CAI. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nData Analyst Intern\n\nReq Number\n\nR6104\n\nEmployment Type\n\nFull time\n\nWorksite Flexibility\n\nRemote\n\nWho We Are\n\nCAI is a global technology services firm with over 8,500 associates worldwide and a yearly revenue of $1 billion+. We have over 40 years of excellence in uniting talent and technology to power the possible for our clients, colleagues, and communities. As a privately held company, we have the freedom and focus to do what is right—whatever it takes. Our tailor-made solutions create lasting results across the public and commercial sectors, and we are trailblazers in bringing neurodiversity to the enterprise.\n\nJob Summary\n\nAs the Data Analyst Intern, you will collaborate with internal stakeholders to understand and document the organization's data reporting needs, data policies, and definitions.\n\nJob Description\n\nWe are looking for a  Data Analyst Intern.  This role is a  full- time, internship role and is remote . The internship dates are June 1, 2026 to July 31 2026.\n\nThis internship is a full-time opportunity requiring a commitment of 40 hours per week. Candidates must be available during core business hours (8:30 pm EST to 5 pm EST) for the entire 9-week duration of the program. Please note that all work must be performed within the United States. This position does not offer work authorization sponsorship now or in the future. Candidates requiring sponsorship will not be considered.\n\nWhat ** You’ll ** Do  \n• Collaborate with internal stakeholders to understand and document the organization's data reporting needs, data policies, and definitions\n• Evaluate existing business processes and workflows, understand the data management/ data governance framework and identify areas for improvement\n• Derive Data Taxonomy from our documented business processes to build the Data Services SOP playbook and hierarchies \n• Develop and maintain documentation, including data glossary, report summaries, process maps, and technical specifications\n• Develop a consistent set of models and templates to document requirements\n• Support testing and validation of reports to ensure they meet business needs and quality standards\n• Dive deep into data to extract important insights\n• Help improve data literacy across the organization and help establish standards for making data-informed decisions\n\nWhat You'll Need  \n\nRequired\n• Pursuing a degree in Data Analytics or a related field\n• Current Junior with a 3.5 GPA or higher\n• Data analysis skills and capabilities with the ability to drive analysis independently\n• Strong skills in understanding data governance frameworks and documentation of the existing processes/workflow, data glossary, etc.\n• Interest in learning the ins and outs of our business structure and data to be an effective data partner \n\nPreferred\n• Knowledge of Data Modeling and exposure to Reporting Tools like Power BI is a plus\n\nPhysical Demands  \n• Ability to safely and successfully perform the essential job functions consistent with the ADA and other federal, state, and local standards \n• Sedentary work that involves sitting or remaining stationary most of the time with occasional need to move around the office to attend meetings, etc. \n• Ability to conduct repetitive tasks on a computer, utilizing a mouse, keyboard, and monitor \n\nThe pay rate for this position is $20 per hour (USD). Exact compensation may vary based on several factors, including location, experience, and education. Benefit packages for this role will include medical coverage as well as 401k retirement account access. Employees in this role may also be entitled to paid sick leave and/or other paid time off as provided by applicable law.\n\n#DNP\n\nReasonable accommodation statement\n\nIf you require a reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employment selection process, please direct your inquiries to application.accommodations@cai.io or (888) 824 – 8111.\n\nThe pay range for this position is listed above. Exact compensation may vary based on several factors, including location, experience, and education. Benefit packages for this role will include medical coverage as well as 401k retirement account access. Employees in this role may also be entitled to paid sick leave and/or other paid time off as provided by applicable law.\n\nIf you have questions about this posting, please contact support@lensa.com",
    "company": "Lensa",
    "location": "Washington, US",
    "url": "https://www.linkedin.com/jobs/view/data-analyst-intern-at-lensa-4303274833?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-12T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0EfPVHF5N0I08Ioa1WKZDYxcfrJkurRgwcHI5&s=0",
    "title": "Summer 2026 Data Science Graduate Intern",
    "description": "Lensa is a career site that helps job seekers find great jobs in the US. We are not a staffing firm or agency. Lensa does not hire directly for these jobs, but promotes jobs on LinkedIn on behalf of its direct clients, recruitment ad agencies, and marketing partners. Lensa partners with DirectEmployers to promote this job for Highmark Health. Clicking \"Apply Now\" or \"Read more\" on Lensa redirects you to the job board/employer site. Any information collected there is subject to their terms and privacy notice.\n\nCompany\n\nHighmark Health\n\nJob Description\n\nApplicants must be authorized to work in the U.S. independently. At this time, we do not offer visa sponsorship for this role.\n\nSummary Of Job Responsibilities\n\nThis job has the goal of providing the opportunity to acquire practical experience through direct exposure to the related business line(s) and to develop the next generation of diverse business professionals. To that end, the program will provide hands-on training and experience in the business line, expose the various career opportunities in the business line and related areas, and prepare participants for positions in the business.\n\nThis internship offers a unique opportunity to contribute to the core of our advanced analytics capabilities by helping to build innovative analytical solutions that impact business processes and operations. As an intern, you will assist in designing, executing, and synthesizing focused analytics to support specific business questions, programs, and initiatives.\n\nRequired Qualifications\n• Bachelor’s degree.\n• Pursuance of a graduate degree full or part-time in an accredited college or university.\n\nPreferred Qualifications\n• Data Science, Statistics, Analytics, Mathematics, or Computer Science major.\n\nEssential Job Functions\n• Communicate effectively. This position displays effective communication skills while interacting directly with colleagues, clientele, and/or other internal or external constituencies in the planning of assignments and the resolution of day-to-day operational problems.\n• Under supervision, provide professional services as appropriate to the day-to-day operating objectives of the area. Receives guidance, training, and mentoring from senior personnel in planning and carrying out activities and assignments.\n• Undertake and/or participate in projects and programs designed to develop professional skills and expertise appropriate to the needs of the organization.\n• Participate in the planning and implementation of unit projects and initiatives within area of expertise and ability.\n• As specifically requested by management, conducts research and reporting inclusive of recommendations or alternative proposals for action.\n• Undertake related studies or enrichment programs as appropriate to the specific objectives of the operating unit.\n• Perform miscellaneous job-related duties as assigned.\n• You will have the chance to apply and develop skills in statistics and machine learning to perform analyses, contribute to predictive models, visualize data, and support projects from inception to delivery. This role also provides exposure to exploring new data sources, tools, and analytical techniques, and collaborating on next-generation analytic projects with our team.\n\nDisclaimer: The job description has been designed to indicate the general nature and essential duties and responsibilities of work performed by employees within this job title. It may not contain a comprehensive inventory of all duties, responsibilities, and qualifications required of employees to do this job.\n\nCompliance Requirement: This position adheres to the ethical and legal standards and behavioral expectations as set forth in the code of business conduct and company policies\n\nAs a component of job responsibilities, employees may have access to covered information, cardholder data, or other confidential customer information that must be protected at all times. In connection with this, all employees must comply with both the Health Insurance Portability Accountability Act of 1996 (HIPAA) as described in the Notice of Privacy Practices and Privacy Policies and Procedures as well as all data security guidelines established within the Company’s Handbook of Privacy Policies and Practices and Information Security Policy. Furthermore, it is every employee’s responsibility to comply with the company’s Code of Business Conduct. This includes but is not limited to adherence to applicable federal and state laws, rules, and regulations as well as company policies and training requirements.\n\nPay Range Minimum\n\nPay Range Maximum:\n\nBase pay is determined by a variety of factors including a candidate’s qualifications, experience, and expected contributions, as well as internal peer equity, market, and business considerations. The displayed salary range does not reflect any geographic differential Highmark may apply for certain locations based upon comparative markets.\n\nHighmark Health and its affiliates prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities and prohibit discrimination against all individuals based on any category protected by applicable federal, state, or local law.\n\nWe endeavor to make this site accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the email below.\n\nFor accommodation requests, please contact HR Services Online at HRServices@highmarkhealth.org\n\nCalifornia Consumer Privacy Act Employees, Contractors, and Applicants Notice\n\nReq ID: J270573\n\nIf you have questions about this posting, please contact support@lensa.com",
    "company": "Lensa",
    "location": "Washington, US",
    "url": "https://www.linkedin.com/jobs/view/summer-2026-data-science-graduate-intern-at-lensa-4313910808?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-12T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTZYNvIzvXgzfvJFbAt7hbGzX0-NFsATO4rWTLa&s=0",
    "title": "Metro College Internship Program - Junior Data Analyst - Operations",
    "description": "Job Description\n\nThe Metro College Internship Program will run from June 1, 2026, to August 14, 2026.\n\nMARKETING STATEMENT\n\nJunior Data Analyst:\n\nOperations at Metro is looking for undergraduate and graduate students interested in gaining hands-on practical experience in delivering transit service. This internship opportunity will allow you to work alongside Operations mentors and leadership to solve real-world problems that have direct, personal impacts on Metro¿s customers and employees.\n\nAssignments may include both office and field work across the DC, Maryland, and Virginia area.\n\nField duties may include interacting with the public, walking railroad tracks, working in bus and rail maintenance facilities, handling tools and equipment, and riding in Metro vehicles.\n\nMINIMUM QUALIFICATIONS AND EXPERIENCE:\n\nGraduation from high school or the possession of a high school equivalency certificate. Applicant must be attending an accredited college or university pursuing a degree in a discipline deemed appropriate for the position intern is seeking.\n\nFor students hired as Summer College Interns, the following distinctions are made from the above provisions of the Student Intern description.\n• The interns major or area of concentration must be aligned with the academic and functional requirements of the position for which the student has applied.\n• The intern should at minimum be a rising college sophomore.\n• The intern must possess a minimum cumulative 2.8 GPA.\n• In cases where the internship is a progressive internship offering the consecutive summer opportunities through graduation, the intern must receive a favorable performance evaluation for the prior summer in order to be considered for each subsequent summer.\n\nMedical Group:\n\nSatisfactorily complete the medical examination for this position, if required. The incumbent must be able to perform the essential functions of this position either with or without reasonable accommodations.\n\nSUMMARY:\n\nThis is an introductory, preparatory and training opportunity for college and graduate students designed to provide hands-on and practical transit industry work experience. Areas include but are not limited to: Bus and/or Rail Operations, Safety/Emergency Management, Engineering, Police, Information Technology, City/Urban Planning and General business functions. The assignments are on a temporary basis not to exceed thirteen (13) weeks of summer employment. Student interns may rotate to various departments based on their major in college/university and/or the respective departmental assignment. The student intern is supervised by an appropriate Executive or designee.\n\nMAJOR DUTIES:\n\nDuties will vary dependent on the assigned department. General duties may include activities in which the student intern:\n\nCompiles, reviews and analyzes data. Operates a personal computer to verify, input and correct data required for producing reports.\n\nResearch data for and assists in the preparation of management, operations, technical and administrative reports. Utilizes management memoranda, fiscal and operations reports and data to complete assignments.\n\nProduces tangible work product specific to the assigned department to include presentations, reports, correspondence, graphic representation of data and/or project plans.\n\nReviews reports to identify problems based upon standard criteria and guidance from supervisors; recommends solutions as instructed.\n\nParticipates in training sessions related to various functions performed by department to which assigned; attends appropriate Authority, departmental and office meetings, etc., in order to gain exposure to transit functions.\n\nParticipates in and/or leads departmental meetings, working sessions, etc.\n\nEvaluation Criteria\n\nConsideration will be given to applicants whose resumes demonstrate the required education and experience. Applicants should include all relevant education and work experience.\n\nEvaluation criteria may include one or more of the following:\n• Skills and/or behavioral assessment\n• Personal interview\n• Verification of education and experience (including certifications and licenses)\n• Criminal Background Check (a criminal conviction is not an automatic bar to employment)\n• Medical examination including a drug and alcohol screening (for safety sensitive positions)\n• Review of a current motor vehicle report\n\nClosing\n\nWMATA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, status as a protected veteran, or any other status protected by applicable federal law.\n\nThis posting is an announcement of a vacant position under recruitment. It is not intended to replace the official job description. Job descriptions are available upon confirmation of an interview.",
    "company": "Washington Metropolitan Area Transit Authority (WMATA)",
    "location": "Washington, US",
    "url": "https://www.linkedin.com/jobs/view/metro-college-internship-program-junior-data-analyst-operations-at-washington-metropolitan-area-transit-authority-wmata-4306156776?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-10T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTwhT7VhfZzjCa9QMcAEU431HGhUB890HSinsJf&s=0",
    "title": "Iridium Software Engineering Internship – Summer 2026 (Virginia)",
    "description": "Company Overview\n\nIridium is an award-winning and innovative satellite communications company with bragging rights to the only network that offers voice and data connectivity anywhere in the world. For over 20 years, Iridium’s unique network and services have supported critical communications needs for individuals, businesses, and the evolving Internet of Things.\n\nAt Iridium, we understand the importance of staying connected and the limitations of traditional communications networks. People across the globe, including first responders, humanitarians, global militaries, scientific researchers, and lone workers, as well as ships, aircraft and remote operations all rely on Iridium to stay connected. We take our responsibility for providing these essential communications very seriously and pride ourselves on offering a reliable lifeline when needed. Likewise, Iridium is committed to providing an exciting and innovative workplace, where employees are challenged to think outside the box and collaborate on new, bold ideas and solutions. Our talented teams are passionate about their work and the impact our company makes around the world. Iridium fosters an empowering and inclusive culture that allows employees to genuinely be their best selves. We are looking for others who want to join this truly unique company that celebrates our employees and provides the opportunity to truly make a difference in the world.\n\nWhat We’re Looking For:\n\nThe Iridium Internship Program provides students the opportunity to support teams driving the future of satellite communications. Interns in Software Engineering gain hands-on experience developing, testing, and deploying software that powers Iridium’s satellite network, ground systems, and global products and services. You’ll collaborate with engineers and technical staff to design tools, automate processes, and build applications that enhance performance, reliability, and efficiency across Iridium’s network and connected products and solutions.\n\nAs an Intern, you’ll begin making an impact on real projects from day one! Come prepared to grow, develop, and learn alongside a team and the leaders of our company. The Iridium Internship program is a 12-week program that runs from May 18,2026 to August 7,2026.\n\nWhat You’ll Do:\n\nProjects are aligned with your academic background, technical interests, and the needs of our teams, and may include:\n• Developing new software features and services, and maintaining or enhancing existing applications and libraries\n• Assisting with architecture, design, coding, testing, and documentation within an Agile/Scrum team\n• Participating in daily stand-ups, sprint planning, backlog refinement, and sprint reviews\n• Gathering requirements and collaborating with stakeholders to design effective solutions\n• Ensuring software meets quality standards through unit and integration testing\n• Maintaining and extending key applications, including GUI frameworks, web applications, and Python/C++ utilities for data management and analysis\n• Developing scripts, simulators, or software tools using Python, Java, or C to support testing and analysis\n• Assisting with simulation, emulation, and verifying performance across Iridium satellite devices and transceivers\n• Participating in code reviews and contributing to automation frameworks for Iridium services and devices\n• Developing scalable, high-performance software and leveraging open-source solutions where appropriate\n\nSkill You'll Gain:\n• Hands-on experience developing software that supports Iridium’s satellite communications system and services\n• Knowledge of object-oriented programming and the full software development lifecycle\n• Exposure to RF design, simulation, and evaluation processes\n• Experience collaborating with team members to implement, build, verify, and troubleshoot software\n• Exposure to modern development tools and workflows, including Jira, GitLab, and Confluence\n• Understanding and application of software engineering best practices to create reliable, maintainable code\n• Understanding how products and services are conceptualized, evaluated, and transitioned into operational functionality\n• Participation in an Agile/Scrum development team working with Python, C, C++, and Java\n\nWhat You’ll Need to Succeed:\n• Interest in software development, product development, and a strong foundation in software engineering concepts, including object-oriented programming, data structures, and algorithms\n• Strong work ethic, positive attitude, and professional demeanor\n• Excellent verbal and written communication skills\n• Ability to work independently and collaboratively in a team\n• Attention to detail and commitment to high-quality results\n\nThings You Must Bring to the Table:\n• Must be at least 18 years of age\n• Currently enrolled in a bachelor’s or graduate degree program at an accredited academic institution\n• Software Engineering, Computer Science, Information Technology, or Data Science/Applied Mathematics preferred\n• U.S. Citizenship required\n• Must be able to work in person at an Iridium location\n\nWork Environment:\n\nThis position primarily works in an office setting and is largely sedentary with the majority of the position working with a computer. The role typically requires the use of basic office equipment such as a phone, video, computer, keyboard, mouse, and printer.\n\nIridium is an Equal Opportunity Employer, including individuals with disabilities and protected veterans.",
    "company": "Iridium",
    "location": "McLean, US",
    "url": "https://www.linkedin.com/jobs/view/iridium-software-engineering-internship-%E2%80%93-summer-2026-virginia-at-iridium-4313237930?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-10T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSwu9DCOgrESAJMAscNmEoOA45poB0j7Ulv7kfp&s=0",
    "title": "Metro College Internship Program-Data Scientist/Engineer I-DTLB",
    "description": "Job Description\n\nThe Metro College Internship Program will run from June 1, 2026, to August 14, 2026.\n\nMarketing Statement\n\nJoin our team and help us shape the future of public transportation in the region! Data Lab is looking to hire a data science intern to work on transforming transit data into applications, data pipelines, and policy recommendations. We are a \"full-stack\" data science team, conducting research, building and deploying them as applications. Candidates with strong coding skills in python, front-end experience, and a passion for public transit are encouraged to apply!\n\nMINIMUM QUALIFICATIONS AND EXPERIENCE:\n\nGraduation from high school or the possession of a high school equivalency certificate. Applicant must be attending an accredited college or university pursuing a degree in a discipline deemed appropriate for the position intern is seeking.\n\nFor students hired as Summer College Interns, the following distinctions are made from the above provisions of the Student Intern description.\n• The intern's major or area of concentration must be aligned with the academic and functional requirements of the position for which the student has applied.\n• The intern should at minimum be a rising college sophomore.\n• The intern must possess a minimum cumulative 2.8 GPA.\n• In cases where the internship is a progressive internship offering the consecutive summer opportunities through graduation, the intern must receive a favorable performance evaluation for the prior summer in order to be considered for each subsequent summer.\n\nMedical Group:\n\nSatisfactorily complete the medical examination for this position, if required. The incumbent must be able to perform the essential functions of this position either with or without reasonable accommodations.\n\nSUMMARY:\n\nThis is an introductory, preparatory and training opportunity for college and graduate students designed to provide hands-on and practical transit industry work experience. Areas include but are not limited to: Bus and/or Rail Operations, Safety/Emergency Management, Engineering, Police, Information Technology, City/Urban Planning and General business functions. The assignments are on a temporary basis not to exceed thirteen (13) weeks of summer employment. Student interns may rotate to various departments based on their major in college/university and/or the respective departmental assignment. The student intern is supervised by an appropriate Executive or designee.\n\nMAJOR DUTIES:\n\nDuties will vary dependent on the assigned department. General duties may include activities in which the student intern:\n\nCompiles, reviews and analyzes data. Operates a personal computer to verify, input and correct data required for producing reports.\n\nResearches data for and assists in the preparation of management, operations, technical and administrative reports. Utilizes management memoranda, fiscal and operations reports and data to complete assignments.\n\nProduces tangible work product specific to the assigned department to include presentations, reports, correspondence, graphic representation of data and/or project plans.\n\nReviews reports to identify problems based upon standard criteria and guidance from supervisors; recommends solutions as instructed.\n\nParticipates in training sessions related to various functions performed by department to which assigned; attends appropriate Authority, departmental and office meetings, etc., in order to gain exposure to transit functions.\n\nParticipates in and/or leads departmental meetings, working sessions, etc.\n\nEvaluation Criteria\n\nConsideration will be given to applicants whose resumes demonstrate the required education and experience. Applicants should include all relevant education and work experience.\n\nEvaluation criteria may include one or more of the following:\n• Skills and/or behavioral assessment\n• Personal interview\n• Verification of education and experience (including certifications and licenses)\n• Criminal Background Check (a criminal conviction is not an automatic bar to employment)\n• Medical examination including a drug and alcohol screening (for safety sensitive positions)\n• Review of a current motor vehicle report\n\nClosing\n\nWMATA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, status as a protected veteran, or any other status protected by applicable federal law.\n\nThis posting is an announcement of a vacant position under recruitment. It is not intended to replace the official job description. Job descriptions are available upon confirmation of an interview.",
    "company": "Washington Metropolitan Area Transit Authority",
    "location": "Washington, US",
    "url": "https://www.indeed.com/viewjob?jk=2c4db4ccac537613&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-07T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ4axFLo0-jvNMFPGq__6-2bt8C90dgfs1uaX5g&s=0",
    "title": "Software Engineer Intern",
    "description": "About Khan Academy\n\nKhan Academy is a nonprofit with the mission to deliver a free, world-class education to anyone, anywhere. Our proven learning platform offers free, high-quality supplemental learning content and practice that cover Pre-K - 12th grade and early college core academic subjects, focusing on math and science. We have over 155 million registered learners globally and are committed to improving learning outcomes for students worldwide, focusing on learners in historically under-resourced communities.\n\nOUR COMMUNITY\n\nOur students, teachers, and parents come from all walks of life, and so do we. Our team includes people from academia, traditional/non-traditional education, big tech companies, and tiny startups. We hire great people from diverse backgrounds and experiences because it makes our company stronger. We value diversity, equity, inclusion, and belonging as necessary to achieve our mission and impact the communities we serve. We know that transforming education starts in-house with learning about ourselves and our colleagues. We strive to be world-class in investing in our people and commit to developing you as a professional.\n\nTHE ROLE\n\nWe are looking for talented software engineers for our remote Summer 2026 internship program.\n\nWe currently use: Go, JavaScript (React / React Native, Redux, Flow), Google App Engine, GraphQL and other technologies that best solve the problem at hand. Here are some examples of recent projects our interns have done:\n• Speech-to-text with push-to-talk for Khanmigo\n• Rewriting the calculator widget user interface\n• Creating tools for classroom teachers\n• Added PhET Interactive Simulations to our content\n\nYou can read about our latest work on our Engineering Blog. A few highlights:\n• Incremental Rewrites with GraphQL\n• Our Transition to React Native\n• Go + Services = One Goliath Project\n• How Engineering Principles Can Help You Scale\n• How to upgrade hundreds of React components without breaking production\n\nWhat You Bring\n• Current enrollment in a Bachelor’s degree program in computer science or a related field\n• An expected graduation date in 2027 or 2028 (rising Junior or Senior)\n• At least one previous software internship experience\n• Ability to start in the month of May/2026 or June/2026 and have 10–12 weeks of availability for our internship\n• Ability to work/live within the United States or Canada for the duration of your internship\n• Motivated by the Khan Academy mission “to provide a free world-class education for anyone, anywhere”\n• Proven cross-cultural competency skills demonstrating self-awareness, awareness of other, and the ability to adopt inclusive perspectives, attitudes, and behaviors to drive inclusion and belonging throughout the organization\n• Eagerness to learn, educate, write code, and build products used by millions of learners and teachers\n• Strong communication, thoughtfulness, and desire to give and receive regular feedback\n• Empathy for learners around the world. You love learning and are excited about helping others learn to love learning. You’re motivated to learn new things and share what you learn with the world\n\nWE WELCOME\n\nSoftware Engineers with experience in any and all technologies. We don't require experience in any particular language or tool. Our commitment to on-boarding and mentorship means you won’t be left in the dark as you learn new technologies.\n\nThe target salary range for this position is $40.38 - $46.15 USD / $54.51 - $62.30 CAD. The pay range for this position is a general guideline only.\n\nThe salary offered will depend on internal pay equity and the candidate’s relevant skills, experience, qualifications, and job market data.\n\nMore About Us\n• Sal’s TED talk from 2011\n• Sal’s TED talk from 2015\n• Sal's TED talk from 2023\n• Our team: http://www.khanacademy.org/about/the-team\n\nOur Company Values\n\nLive & breathe learners\n\nWe deeply understand and empathize with our users. We leverage user insights, research, and experience to build content, products, services, and experiences that our users trust and love. Our success is defined by the success of our learners and educators.\n\nTake a stand\n\nAs a company, we have conviction in our aspirational point of view of how education will evolve. The work we do is in service to moving towards that point of view. However, we also listen, learn and flex in the face of new data, and commit to evolving this point of view as the industry and our users evolve.\n\nEmbrace diverse perspectives\n\nWe are a diverse community. We seek out and embrace a diversity of voices, perspectives and life experiences leading to stronger, more inclusive teams and better outcomes. As individuals, we are committed to bringing up tough topics and leaning into different points of view with curiosity. We actively listen, learn and collaborate to gain a shared understanding. When a decision is made, we commit to moving forward as a united team.\n\nWork responsibly and sustainably\n\nWe understand that achieving our audacious mission is a marathon, so we set realistic timelines and we focus on delivery that also links to the bigger picture. As a non-profit, we are supported by the generosity of donors as well as strategic partners, and understand our responsibility to our finite resources. We spend every dollar as though it were our own. We are responsible for the impact we have on the world and to each other. We ensure our team and company stay healthy and financially sustainable.\n\nBring out the joy\n\nWe are committed to making learning a joyful process. This informs what we build for our users and the culture we co-create with our teammates, partners and donors.\n\nCultivate learning mindset\n\nWe believe in the power of growth for learners and for ourselves. We constantly learn and teach to improve our offerings, ourselves, and our organization. We learn from our mistakes and aren’t afraid to fail. We don't let past failures or successes stop us from taking future bold action and achieving our goals.\n\nDeliver wow\n\nWe insist on high standards and deliver delightful, effective end-to-end experiences that our users can rely on. We choose to focus on fewer things — each of which aligns to our ambitious vision — so we can deliver high-quality experiences that accelerate positive measurable learning with our strategic partners.\n\nWe are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, gender, gender identity or expression, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status. We value diversity, equity, and inclusion, and we encourage candidates from historically underrepresented groups to apply.\n\nAs part of this commitment, Khan Academy will ensure that persons with disabilities are provided reasonable accommodations for the hiring process. If reasonable accommodation is needed, please contact careers@khanacademy.org",
    "company": "Khan Academy",
    "location": "Friendly, US",
    "url": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-khan-academy-4309484474?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-10-05T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkvgnQ1oxT349wNQYexZtVJB_6j7MtlDEHpwNQ&s=0",
    "title": "Internships in Data Science, Math, Statistics or Operations Research",
    "description": "Why choose between doing meaningful work and having a fulfilling life? At MITRE, you can have both. That's because MITRE people are committed to tackling our nation's toughest challenges—and we're committed to the long-term well-being of our employees. MITRE is different from most technology companies. We are a not-for-profit corporation chartered to work for the public interest, with no commercial conflicts to influence what we do. The R&D centers we operate for the government create lasting impact in fields as diverse as cybersecurity, healthcare, aviation, defense, and enterprise transformation. We're making a difference every day—working for a safer, healthier, and more secure nation and world. Our workplace reflects our values. We offer competitive benefits, exceptional professional development opportunities for career growth, and a culture of innovation that embraces adaptability, collaboration, technical excellence, and people in partnership. If this sounds like the choice you want to make, then choose MITRE - and make a difference with us.\n\nNOTE: Thank you for your interest in MITRE’s internship opportunities. Please be aware that this is not an application for a specific position. By submitting your information and providing your resume, you will be included in a pool of candidates for various internship roles across the company. If you are selected for consideration for a particular internship, a member of MITRE’s Student Programs team will reach out to you. The primary hiring season for MITRE internships runs from September through March. You can monitor your application status here: Workday (myworkdayjobs.com).\n\nJob Responsibilities\n\nAs an intern working in data science, operations research, math or statistics, you will work alongside a team of experts to apply your knowledge and gain hands-on experience in one or more of the following areas:\n• Data analysis and visualization\n• Augmented decision-making and trusted analytics\n• Applied mathematics, statistics, and optimization\n• Simulation and computational analytics\n• Systems modeling and analysis\n• Operational effectiveness and efficiency\n• Knowledge discovery\n• Next-generation data environments\n\nBasic Qualifications\n• Must be a full-time student pursuing an accredited degree program in Data Science, Math, Statistics, Operations Research or related disciplines.\n• Must continue to be enrolled the semester following the internship.\n• Foundational knowledge of data science, math, statistics or operations research methodologies, frameworks, tools and/or programming languages.\n• Must have sustained excellence in academic performance.\n\nPreferred Qualifications\n• Experience applying data science, math, statistics or operations research concepts in an internship, research, or lab setting.\n• Proficiency using data science, math, statistics or operations research methodologies, frameworks, tools and/or programming languages.\n• Demonstrated interest in serving the public through previous work experience, volunteer activities, or other relevant engagements.\n\nClearance: In addition to passing MITRE’s employment background check, you may be submitted for a U.S. Government Security clearance. This is determined by the Department of Defense’s adjudicative guidelines for receiving a clearance, to include U.S. citizenship. Other jobs may require vetting for various levels of agency public trust, fitness, suitability, controlled access, and special programs access determination consistent with the work program to which you are assigned.\n\nThis requisition requires the candidate to have a minimum of the following clearance(s):\n\nThis requisition requires the hired candidate to have or obtain, within one year from the date of hire, the following clearance(s):\n\nSalary compensation range and midpoint:\n\n$45,500 - $57,000 - $68,500 Annual\n\nWork Location Type:\n\nHybrid\n\nIt is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.\n\nCommitment to Non-Discrimination\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local or international law.\n\nMITRE intends to maintain a website that is fully accessible to all individuals. If you are unable to search or apply for jobs and would like to request a reasonable accommodation for any part of MITRE’s employment process, please email recruitinghelp@mitre.org for general support and collegerecruiting@mitre.org for intern positions. This service is for individuals requiring reasonable accommodation requests. Please note that vendor solicitations will not receive a reply.\n\nBenefits information may be found here.\n\nCopyright © 1997-2025, The MITRE Corporation. All rights reserved. MITRE is a registered trademark of The MITRE Corporation. Material on this site may be copied and distributed with permission only.",
    "company": "MITRE",
    "location": "McLean, US",
    "url": "https://www.linkedin.com/jobs/view/internships-in-data-science-math-statistics-or-operations-research-at-mitre-4305433072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": "2025-09-25T00:00:00.000Z",
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQAMVnHFh_IbJak2Lg1O20HiBAQLWyrLUX3E3L6&s=0",
    "title": "Intern-Data Analysis, Alexandria VA Summer 2026",
    "description": "Intern – Data Analytics\n\nCLASSIFICATION: Non-exempt\n\nREPORTS TO: Chief Operating Officer\n\nJOB DESCRIPTION\n\nSummary/Objective\n\nTemporary part-time intern needed to perform data analytic duties for the bank’s operations organization.\n\nEssential Functions\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n• Assist department with special projects as assigned\n• Import, scrub, export, profile, verify, sort, group, combine and sample data\n• Develop analytical scripts for assigned project\n• Document results of analytical testing\n• Create visualization reports for results of analytical project\n\nSkills/Abilities\n• Professional written and verbal communication skills\n• High level of professionalism\n• Highly organized with attention to detail\n• Ability to follow instructions and work independently on multiple tasks.\n• Computer experience required, with working knowledge of Microsoft Word, Excel, and Outlook\n• General knowledge of data analytic scripting preferred\n\nSupervisory Responsibility\n\nThis position does not have supervisory responsibilities.\n\nWork Environment\n\nThis job operates in an office setting, the opportunity to telework is not available. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. Office environment with job duties conducted via telephone, face to face meetings, and on the computer.\n\nPhysical Demands\n\nThis position requires manual dexterity, the ability to lift files and open cabinets. This position requires bending, stooping or standing as necessary.\n\nTravel\n\nLimited local travel may be required for this position.\n\nEducation and Experience\n• Current undergraduate student, preferably majoring in data analytics or a related field.\n\nEqual Employment Opportunity/M/F/disability/protected veteran status\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.",
    "company": "Burke & Herbert Bank & Trust",
    "location": "Alexandria, US",
    "url": "https://www.indeed.com/viewjob?jk=34f510d917a7bf34&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTlpiaTF61kmh8iY3bYv-O-78tlptWh_qoJ5dLb&s=0",
    "title": "Internship - Data Analytics/National Security Intern",
    "description": "About the position\n\nResponsibilities\n• Assist in analyzing real-time emergency alerting information.\n• Evaluate 911 location determination technologies.\n• Investigate disruptions to communications during disasters.\n• Examine disruptions to communications during normal conditions.\n• Work on a specific project defined by the Bureau's Associate Bureau Chief and Chief Data Officer.\n\nRequirements\n• Currently enrolled in a degree program related to data analytics, national security, or a related field.\n• Strong analytical skills and ability to work with data.\n• Familiarity with data analysis tools and techniques.\n\nNice-to-haves\n• Experience with algorithm development.\n• Knowledge of communications technologies and systems.\n• Interest in public policy and regulatory processes.\n\nBenefits\n• Gain practical experience in data analytics and national security.\n• Opportunity to work with experienced professionals in the field.\n• Potential for academic credit or stipend funding.",
    "company": "United States Government",
    "location": "Washington, US",
    "url": "https://www.tealhq.com/job/internship-data-analytics-national-security-intern_82acb949-0014-4686-89ce-4e9609066df7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Data Analytics Intern",
    "description": "About This Internship\n\nArch’s internship program offers students a unique opportunity to gain hands on experience in the insurance industry. It provides challenging learning experiences that serve as a foundation for interns to explore their career choices and to develop professional skills. Working alongside some of the most talented members of the specialty insurance industry, interns will gain relevant expertise in various aspects of the field, participate in learning activities and receive ongoing feedback.\n\nAbout This Role\n• Collect, clean, and prepare data for analysis, ensuring data integrity and completeness.\n• Perform basic descriptive and trending analysis.\n• Partner with stakeholders to develop data-driven solutions for their challenges.\n• Compile analysis results into structured reports, ensuring clarity and coherence. This involves writing summaries and conclusions based on data analysis.\n• Utilize version control systems (e.g., Git) to manage changes to analysis scripts and documentation, ensuring that updates are tracked, and previous versions can be retrieved if necessary.\n\nQualifications\n• Actively completing graduate degree in Data Science, Computer Science, Computer Engineering, Information Systems, Business Analytics, or related program.\n• Minimum 3.0 GPA or higher.\n• College level – Junior or Senior student with graduation dates between December 2026 and May 2027.\n• Proficiency in SQL and Pythton required. Awareness of additional analytics tools/languages a plus.\n• Fundamental understanding of data visualization tools and design, including Tableau or Power BI, preferred.\n• Familiarity with cloud-based technologies required. Exposure to Azure preferred.\n• Data governance familiarity and framework experience with Data Quality, Meta Data Management, Data Lineage, Data Management Principles (Data Storage) a plus.\n• Proficient in MS Office suite of tools and in particular Excel and PowerPoint\n• Broad analytical, problem solving and organizational skills.\n• Entrepreneurial spirit along with the desire to be a continuous learner.\n• Team player who collaborates effectively.\n• Self-starter who can work independently and deal effectively with multiple tasks/priorities in a fast-paced environment.\n\nLocation & Work Arrangement\n• The program dates are June 1, 2026 - August 7, 2026.\n• This position is classified as a hybrid position. You will work 2 days onsite and 3 days from home.\n• This position is located in Washington, DC.\n• Relocation and housing assistance is not provided for this role.\n\nPay\n\nFor individuals assigned to or hired to work in Washington, DC, the hourly rate is $26 as of the time of posting. The breadth in the range exists to accommodate students in specialized programs such as actuarial candidates and graduate students. Any actual rate offered will take into account a number of factors including but not limited to geographic location, scope & responsibilities of the role, along with the education & qualifications of the candidate. The above range may be modified in the future. Intern position is eligible for select Arch benefits.",
    "company": "Arch U.S. MI Services Inc.",
    "location": "Washington, US",
    "url": "https://careercenter.actuary.org/jobs/21623434/data-analytics-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTxLK8zDsS783amwzUdnaVe2zDIPDg-LK3PVLc9&s=0",
    "title": "Data Scientist Intern",
    "description": "About Simatree\n\nSimatree is a data-driven consulting firm that blends strategic insight with deep technical capabilities. We help clients unlock the power of data for transformation and growth. We are looking for a Data Science intern to ideally work for the fall 2025 and spring 2026 semesters to support an innovative project focused on building a Sports Data Ecosystem. This paid internship.\n\nProject Overview\n\nWe aim to unify disconnected data sources (e.g., stats, wearables, recruiting, NIL, social media) into a scalable data model that supports real-world use cases such as:\n\n· Talent evaluation\n\n· Injury risk forecasting\n\n· NIL (Name, Image & Likeness) strategy\n\n· Sponsorship targeting\n\n· Sports betting analytics\n\nYou will work with a cross-functional team to help structure, clean, merge, and analyze these data sources.\n\nKey Responsibilities\n• Identify, access, and assess relevant sports data sources for consistency, quality, and value.\n• Normalize and integrate data into a unified schema for longitudinal athlete tracking.\n• Build Python-based pipelines for data ingestion, cleaning, transformation, and validation.\n• Support the development of predictive models (e.g., talent forecasting, NIL potential).\n• Document data architecture, assumptions, and transformation steps.\n• Collaborate to ensure privacy and governance compliance, especially for youth data.\n• Assist in testing real-world use cases and delivering insights to stakeholders.\n\nRequired Qualifications\n• Currently enrolled in an accredited university in the state of Virginia. Please do not apply if you do not meet this requirement.\n• Pursuing a degree in Data Science, Statistics, Computer Science, or related field.\n• Strong proficiency in Python (especially Pandas, NumPy, scikit-learn, and APIs).\n• Experience with data wrangling and exploratory data analysis (EDA).\n• Familiarity with youth sports data or interest in sports analytics a plus.\n• Experience with databases (SQL or NoSQL), data privacy best practices, or cloud tools (e.g., Databricks, AWS, Azure) is a bonus.\n• Excellent documentation, teamwork, and communication skills.\n\nWhat You’ll Gain\n\n· Experience working on a cutting-edge, mission-driven project in sports data analytics.\n\n· Exposure to data strategy, governance, and real-world use case development.\n\n· Collaboration with mentors across analytics, consulting, and the sports ecosystem.\n\n· Opportunities to contribute to presentations, stakeholder demos, and potential pilot rollouts\n• Paid Internship: $24/hour",
    "company": "Simatree",
    "location": "Arlington, US",
    "url": "https://www.aijobs.com/jobs/152479515-data-scientist-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7qIzvQwrAcdm7JrbaVnaB3Vi-BZ4kmNaOqHeN&s=0",
    "title": "Data Scientist, Research Intern, PhD, Summer 2026",
    "description": "Please complete your application before October 31st, 2025.\n\nApplications will be reviewed on a rolling basis and it’s in a candidate’s best interest to apply early.\n\nTiming on when you can hear back will vary and can take upwards of 90+ days. If you haven’t heard from us in three months about your application, we likely proceeded with other candidates for the role.\n\nParticipation in the internship program requires that you are located in the United States for the duration of the internship program.\n\nThis internship is intended for students in their penultimate academic year, who are pursuing a PhD degree program in a quantitative discipline (e.g., statistics, biostatistics, physics, applied mathematics, operations research, economics).\n\nGoogle is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for this internship program.\n\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n• In the “Resume Section:” attach an updated CV or resume.\n• Please ensure you’ve listed your anticipated graduation date (in MM/YY)\n• In the “Education Section:” attach a current or recent unofficial or official transcript in English.\n• Under “Degree Status,” select “Now attending” to upload a transcript.\n\nThis role may also be located in our Playa Vista, CA campus.\n\nApplicants in the County of Los Angeles: Qualified applications with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nApplicants in San Francisco: Qualified applications with arrest or conviction records will be considered for employment in accordance with the San Francisco Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Mountain View, CA, USA; Ann Arbor, MI, USA; Atlanta, GA, USA; Austin, TX, USA; Boulder, CO, USA; Bellevue, WA, USA; Cambridge, MA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Portland, OR, USA; Pittsburgh, PA, USA; Raleigh, NC, USA; Durham, NC, USA; Reston, VA, USA; Redmond, WA, USA; Redwood City, CA, USA; San Diego, CA, USA; Goleta, CA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; San Jose, CA, USA; Santa Cruz, CA, USA; South San Francisco, CA, USA; Sunnyvale, CA, USA; Washington D.C., DC, USA.\nMinimum qualifications:\n• Currently pursuing a PhD degree in a quantitative discipline (e.g., statistics, biostatistics, physics, applied mathematics, operations research, economics).\n• Experience with statistical methods (linear models, multivariate analysis, stochastic processes, sampling methods, etc.).\n• Experience with data analysis.\n• Experience using R or Python and technology to work with datasets such as scripting or statistical software (R, SAS, etc.).\n\nPreferred qualifications:\n• Currently attending a degree program in the US and available to work full time for 12 weeks outside of university term time.\n• In their penultimate academic year or returning to a degree program after completion of the internship.\n• Ability to draw conclusions from data and recommend actions.\n• Ability to take on a leadership role and take initiative.\n• Interest in learning new techniques.\n\nAbout the job\n\nAt Google, data drives all of our decision-making. In the Data Scientist - Research role, you will work all across the organization to help shape Google's business and technical strategies by processing, analyzing, and interpreting huge data sets. Using analytical excellence and statistical methods, you will mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. You will work with Engineers, Product Managers, Sales Associates, and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.\n\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n\nThe US base salary range for this full-time position is $113,000-$150,000. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n• Work with large complex data sets, solve difficult non-routine analysis problems, and apply advanced analytical methods. Conduct analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.\n• Build and prototype analysis pipelines iteratively to provide insights at scale. Develop a comprehensive understanding of Google data structures and metrics, advocating for changes.\n• Interact cross-functionally with a wide variety of people and teams. Work closely with engineers to identify opportunities, design and assess improvements to Google products.\n• Make business recommendations (e.g., cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.\n• Research and develop analysis, forecasting, and optimization methods to improve the quality of Google's user products.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
    "company": "Google",
    "location": "Washington, US",
    "url": "https://www.indeed.com/viewjob?jk=3beb74260942168d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7qIzvQwrAcdm7JrbaVnaB3Vi-BZ4kmNaOqHeN&s=0",
    "title": "Business Data Scientist Intern, PhD, Summer 2026",
    "description": "Please complete your application before October 31st, 2025.\n\nApplications will be reviewed on a rolling basis and it’s in a candidate’s best interest to apply early.\n\nTiming on when you can hear back will vary and can take upwards of 90+ days. If you haven’t heard from us in three months about your application, we likely proceeded with other candidates for the role.\n\nParticipation in the internship program requires that you are located in the United States for the duration of the internship program.\n\nThis internship is intended for students in their penultimate academic year, who are pursuing a PhD degree program in a quantitative discipline (e.g., statistics, biostatistics, physics, applied mathematics, operations research, economics).\n\nGoogle is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for this internship program.\n\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):\n• In the “Resume Section:” attach an updated CV or resume.\n• Please ensure you’ve listed your anticipated graduation date (in MM/YY)\n• In the “Education Section:” attach a current or recent unofficial or official transcript in English.\n• Under “Degree Status,” select “Now attending” to upload a transcript.\n\nApplicants in the County of Los Angeles: Qualified applications with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nApplicants in San Francisco: Qualified applications with arrest or conviction records will be considered for employment in accordance with the San Francisco Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nThis role may also be located in our Playa Vista, CA campus.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Mountain View, CA, USA; Ann Arbor, MI, USA; Atlanta, GA, USA; Austin, TX, USA; Boulder, CO, USA; Bellevue, WA, USA; Cambridge, MA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Portland, OR, USA; Pittsburgh, PA, USA; Raleigh, NC, USA; Durham, NC, USA; Reston, VA, USA; Redmond, WA, USA; Redwood City, CA, USA; San Diego, CA, USA; Goleta, CA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; San Jose, CA, USA; Santa Cruz, CA, USA; Sunnyvale, CA, USA; Washington D.C., DC, USA.\nMinimum qualifications:\n• Currently pursuing a PhD degree in a quantitative discipline (e.g., statistics, biostatistics, physics, applied mathematics, operations research, economics).\n• Experience with statistical methods (i.e., linear models, multivariate analysis, stochastic processes, sampling methods, etc.).\n• Experience with statistical software (e.g., R, Python, MATLAB) and database languages (i.e., SQL).\n\nPreferred qualifications:\n• Currently attending a degree program in the US and available to work full time for 12 weeks outside of university term time.\n• In their penultimate academic year or returning to a degree program after completion of the internship.\n• Experience leveraging data insights into storytelling for business stakeholders.\n• Experience in controlled experiment design and causal inference methods.\n• Ability to prioritize requests and partner well in an environment with competing demands from stakeholders.\n\nAbout the job\n\nAs a Business Data Scientist, you will be a subject matter specialist for translating business problems from your supported organization or functional area into analytical solutions and insights. You will provide technical mentorship in delivering project work including implementing data science solutions, improving data pipelines, developing evaluation metrics, or building statistical models that provide insights to the business. You will create and implement reused and scaled solutions within the team's development process. You will collaborate with supported teams and win stakeholder trust by translating business needs into tractable analyses or evaluation metrics. You will work closely with product and engineering teams to analyze impact on product or Google-wide metrics (including daily activities, retention, churn).\n\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n\nThe US base salary range for this full-time position is $113,000-$150,000. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n• Work with large complex data sets, solve difficult non-routine analysis problems, and apply advanced analytical methods. Conduct analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.\n• Build and prototype analysis pipelines iteratively to provide insights at scale. Develop a comprehensive understanding of Google data structures and metrics, advocating for changes.\n• Design and analyze controlled experiments or counterfactual causal inference studies to examine the incremental impact of Ads marketing programs.\n• Interact cross-functionally, making business recommendations (e.g., cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.\n• Develop and automate reports, and iteratively build and prototype dashboards to provide insights at scale, solving for business priorities.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
    "company": "Google",
    "location": "Washington, US",
    "url": "https://www.indeed.com/viewjob?jk=347a13ec4d4030aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": null,
    "title": "Data Scientist Intern",
    "description": "About the position\n\nResponsibilities\n• Support and conduct projects requiring interdisciplinary methods including predictive analytics and geospatial analysis.\n• Develop and apply models and concepts to illuminate management issues and suggest solutions.\n• Elicit requirements from analytic team members and identify datasets for analysis.\n• Work with structured and unstructured data to identify trends and patterns.\n• Evaluate and recommend new methodologies and analytical tools.\n• Employ data modeling processes to create algorithms and predictive models.\n• Conduct data storytelling by generating reports and visualizations.\n\nRequirements\n• Currently enrolled, full-time student in a bachelor's degree program or above at an accredited university.\n• Familiarity with analytic tools such as Python, R, SQL, MATLAB, Java, SAS, Stata, SPSS, Tableau.\n• Ability to query, manipulate, and analyze large and complex datasets.\n• Must be a U.S. Citizen.\n• Must be able to obtain and maintain DHS suitability.\n\nBenefits\n• Opportunities for career advancement and continued learning.\n• Flexible work environment with autonomy in project selection.",
    "company": "Applied Research Associates",
    "location": "Alexandria, US",
    "url": "https://www.tealhq.com/job/data-scientist-intern_80be8559-8f22-4a38-8a0e-ff2f3a673b7d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR7qIzvQwrAcdm7JrbaVnaB3Vi-BZ4kmNaOqHeN&s=0",
    "title": "Software Engineering Intern, BS, Summer 2026",
    "description": "Applications will be reviewed on a rolling basis and it’s in the candidate’s best interest to apply early. The anticipated application window is open until October 31, 2025, but may close earlier if all available projects are full. Applications submitted after the application window or once role is closed/projects are full will not be considered.\n\nTiming on when you can hear back will vary and can take upwards of 90+ days. If you haven’t heard from us in three months about an application, we likely proceeded with other candidates for that particular role. However, our recruiters might reach out if we find a different potential match for your skills, interests, and experience.\n\nParticipation in the internship program requires that you are located in the United States for the duration of the internship program.\n\nThis internship is intended for students in all academic years, who are pursuing a Bachelor's degree program in Computer Science or a related field.\n\nGoogle is a global company and, in order to facilitate efficient collaboration and communication globally, English proficiency is a requirement for this internship program.\n\nTo start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred).\n\n1. In the “Resume Section:” attach an updated CV or resume.\n\n2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.\n• Under “Degree Status,” select “Now attending” to upload a transcript.\n\nWe offer a range of internships in either Software Engineering or Site-Reliability Engineering across North America, including the US and Canada. Our recruitment team will determine where you fit best based on your resume.\n\nApplicants in the County of Los Angeles: Qualified applications with arrest or conviction records will be considered for employment in accordance with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nApplicants in San Francisco: Qualified applications with arrest or conviction records will be considered for employment in accordance with the San Francisco Fair Chance Ordinance for Employers and the California Fair Chance Act.\n\nThis role may also be located in our Playa Vista, CA campus.\n\nNote: By applying to this position you will have an opportunity to share your preferred working location from the following: Mountain View, CA, USA; Atlanta, GA, USA; Austin, TX, USA; Boulder, CO, USA; Cambridge, MA, USA; Bellevue, WA, USA; Chicago, IL, USA; Irvine, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; Madison, WI, USA; New York, NY, USA; Palo Alto, CA, USA; Portland, OR, USA; Pittsburgh, PA, USA; Raleigh, NC, USA; Durham, NC, USA; Reston, VA, USA; Redmond, WA, USA; Redwood City, CA, USA; San Diego, CA, USA; Goleta, CA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; San Jose, CA, USA; Santa Cruz, CA, USA; South San Francisco, CA, USA; Sunnyvale, CA, USA; Washington D.C., DC, USA.\nMinimum qualifications:\n• Pursuing a Bachelor's degree or post secondary or training experience with a focus on subjects in software development or other technical related fields.\n• Experience in software development and coding in two or more general purpose programming languages (e.g., C, C++, Java, JavaScript, Python, etc.).\n• Experience with data structures or algorithms gathered from inside or outside of school or work.\n\nPreferred qualifications:\n• Currently attending a degree program in the US and available to work full time for 12 weeks outside of university term time.\n• Returning to a degree program after completion of the internship.\n• Experience programming in three or more of the following languages: C, C++, C#, Java, JavaScript, Kotlin, Go, Python, Typescript or similar.\n• Experience with web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, or security software development.\n\nAbout the job\n\nJoin us for a unique 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. The Software Developer Internship program will give you an opportunity to work on complex computer science solutions, develop scalable, distributed software systems, and also collaborate on multitudes of smaller projects that have universal appeal.\n\nAs a Software Engineering intern, you will work on a specific project critical to Google’s needs. Google is working to advance the state of the art in computing and build the next generation of intelligent systems for all Google products. To achieve this, we work on projects that utilize the latest computer science techniques developed by skilled software developers. Whether we're shaping the future of sustainability, optimizing algorithms, or pioneering AI systems, our teams strive to continuously progress science, advance society, and improve the lives of billions of people.\n\nSoftware Engineering Intern:\n\nAs a key member of a versatile team, you will work on a specific project critical to Google’s needs. We need our developers to be versatile and enthusiastic in addressing new problems as we continue to push technology forward. You will design, test, deploy and maintain software solutions as you grow and evolve during your internship.\n\nSite Reliability Intern:\n\nOur developers create, fix, extend and scale the code to keep it working and to harden it against all the bad actors of the internet. We drive reliability and performance on a massive scale. You will work on software development projects to keep important systems up and running, from code-level troubleshooting of traffic anomalies to maintenance of our most cutting-edge services, from monitoring and alerts to building new automation infrastructure.\n\nGoogle is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to address some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.\n\nThe US base salary range for this full-time position is $92,000-$122,000. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n• Create and support a productive and innovative team including working with peers, managers, and teams.\n• Develop scripts to automate routine tasks.\n• Analyze information and evaluate results to choose the best solution to effectively solve problems.\n• Apply knowledge gained in computer science courses to real world problems.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.",
    "company": "Google",
    "location": "Washington, US",
    "url": "https://www.indeed.com/viewjob?jk=4f4e8e161109863a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSUiiAgGHeGvgzmYrAAbuQinCTi_rE4oG6TNAvT&s=0",
    "title": "Software Engineer, Internship - Production Infrastructure",
    "description": "A World-Changing Company\n\nPalantir builds the world’s leading software for data-driven decisions and operations. By bringing the right data to the people who need it, our platforms empower our partners to develop lifesaving drugs, forecast supply chain disruptions, locate missing children, and more.\n\nThe Role\n\nSoftware Engineers At Palantir Drive Large-scale Transformation Through Data, AI And World-leading Infrastructure That Supports Mission-critical Workloads. As a Software Engineer Intern, You’ll Have An Opportunity To Grow More Quickly Than You Ever Envisioned As You Contribute High-quality Code Directly To\n• Rubix and Apollo , platforms deployed at the most important institutions across the public and private sectors.\n• Shaping Mission Manager , our new internal-infrastructure business line, used by advanced civil and defense agencies worldwide to power their infrastructure in highly sensitive environments\n• Building the core capabilities used by advanced civil and defense agencies worldwide to power their infrastructure\n• Providing the substrate on which Palantir deploys its other platforms, Foundry and Gotham, which power workflows for research scientists, aerospace engineers, intelligence analysts and economic forecasters.\n\nYou’ll join our Production Infrastructure organization, made up of small teams of engineers working on:\n• Environment Platform: a Kubernetes-based PaaS spanning hundreds of production clusters\n• Apollo: secure, fleet-wide deployment and change-management for complex microservice suites\n• Signals: our full suite of observability and alerting tools\n\nCore Responsibilities\n\nAs a Software Engineer Intern at Palantir, you’ll own every phase of the product lifecycle—from generating ideas and designing prototypes to executing features and shipping releases—while being paired with a dedicated mentor who champions your growth. You’ll work hand-in-hand with both technical and non-technical colleagues to uncover real customer problems and deliver solutions that address them. To gain firsthand insight, you might sit side-saddle at a military exercise or partner directly with vendors using Palantir’s Apollo & Rubix to put our software into the hands of warfighters and government workers.\n\nSWE Principles Include\n• Ownership: We see projects through from beginning to end in spite of obstacles we may encounter.\n• Collaboration: We work internally with people from a variety of backgrounds — such as other Software Engineers, Product Managers, Designers and Product Reliability Engineers. We also partner with our business development teams (Forward Deployed Engineers, Deployment Strategists) in order to understand and solve our customers' problems.\n• Trust: We trust each other to effectively handle time and priorities, and don't micromanage. We want people to have the space to think for themselves, while feeling supported by their team.\n\nTechnologies We Use\n\nSkills\n\nIt doesn’t matter what languages you know when you join us, but it does matter that you can write clean, effective code and learn new languages quickly. Our software is constantly evolving, so we need engineers who can do the same. Alongside peers that bring diverse experience - whether you’re a former university TA, switched to CS recently, or are a hackathon enthusiast — you'll build your skills to apply the best technology to solve a given problem. Right now, we use:\n• A variety of languages, including Java and Go for backend and Typescript for frontend\n• Open-source technologies like Kubernetes, Cilium, Envoy, Grafana, React, and Redux\n• Industry-standard tooling, including Gradle and GitHub, and agentic tools like Windsurf & Cline\n\nWhat We Value\n• Ability to communicate and collaborate with a variety of individuals, including engineers, users and non-technical team members.\n• Willingness to learn and make decisions independently, and the ability to ask questions when needed.\n• Active US Security clearance, or eligibility and willingness to obtain a US Security clearance.\n\nWhat We Require\n• Engineering background in fields such as Computer Science, Mathematics, Software Engineering, and Physics.\n• Familiarity with data structures, storage systems, cloud infrastructure, front-end frameworks, and other technical tools.\n• Experience coding in programming languages, such as Java, C++, Python, JavaScript, or similar languages.\n• Must be planning on graduating in 2027. This should be your final internship before graduating.\n\nTo Apply, Please Submit The Following\n• An updated resume / CV - please do so in PDF format.\n• Thoughtful responses to our application questions.\n\nSalary\n\nThe estimated salary range for this position is estimated to be $10,500/month. Further note that total compensation for this position will be determined by each individual’s relevant qualifications, work experience, skills, and other factors. This estimate excludes the value of any benefits offered; and the potential future value of any long-term incentives.\n\nLife at Palantir\n\nWe want every Palantirian to achieve their best outcomes, that’s why we celebrate individuals’ strengths, skills, and interests, from your first interview to your longterm growth, rather than rely on traditional career ladders. Paying attention to the needs of our community enables us to optimize our opportunities to grow and helps ensure many pathways to success at Palantir. Promoting health and well-being across all areas of Palantirians’ lives is just one of the ways we’re investing in our community. Learn more at Life at Palantir and note that our offerings may vary by region.\n\nIn keeping consistent with Palantir’s values and culture, we believe employees are “better together” and in-person work affords the opportunity for more creative outcomes. Therefore, we encourage employees to work from our offices to foster connectivity and innovation. Many teams do offer hybrid options (WFH a day or two a week), allowing our employees to strike the right trade-off for their personal productivity. Based on business need, there are a few roles that allow for “Remote” work on an exceptional basis. If you are applying for one of these roles, you must work from the state in which you are employed. If the posting is specified as Onsite, you are required to work from an office.\n\nIf you want to empower the world's most important institutions, you belong here. Palantir values excellence regardless of background. We are proud to be an Equal Opportunity Employer for all, including but not limited to Veterans and those with disabilities. Palantir is committed to making the application and hiring process accessible to everyone and will provide a reasonable accommodation for those living with a disability. If you need an accommodation for the application or hiring process, please reach out and let us know how we can help.",
    "company": "Palantir Technologies",
    "location": "Washington, US",
    "url": "https://www.linkedin.com/jobs/view/software-engineer-internship-production-infrastructure-at-palantir-technologies-4288027569?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoFiPWdBP59ZVQ0WuEHtRZ5tE6JexEQ6vw8bqD&s=0",
    "title": "Software Engineering Intern",
    "description": "About Lynk\n\nLynk is the inventor of satellite direct to device or D2D technology, and has the world’s only commercial license from the FCC to operate a commercial D2D system. Today, Lynk allows mobile network operators' subscribers to send and receive text messages to and from space via standard unmodified, mobile devices. Lynk’s service has been tested and proven on all seven continents, has regulatory approvals in more than 30 countries and is currently being deployed commercially based on more than 40 MNO commercial service contracts covering approximately 50 countries.\n\nOur technology will enable all 8 billion people on the planet to stay connected with the existing standard phone in their pocket. Everywhere. No matter what.\n\nBy joining Lynk, you will have the opportunity to directly touch the lives of billions. Your mission will be to bring mobile broadband to billions, pull hundreds of millions out of poverty, and save countless lives.\n\nJoin US to Help Connect the World!\n\nWe are hiring Software Engineer Interns with a BS, Masters, or PhD across the following disciplines... computer science, computer engineering and other STEM related fields.\n\nIf you have a particular focus in telecommunications, software defined radio, robotics, and/or space systems, we’d love to hear from you!\n\nInternships\n\nAt Lynk, there are a variety of opportunities available. Software Engineering Intern positions are available to students who are enrolled in a bachelor’s or graduate-level degree in Computer Engineering, Computer Science or another relevant STEM-field. You will be responsible for working both autonomously and collaboratively working on actual space and telecommunications/software/hardware development projects. Since Lynk is responsible for the design, build, test, and operation of satellites through the full life cycle, intern engineers will be exposed to every phase of what is involved in getting satellites on orbit and flying them. We seek multidisciplinary technical talent to support the design and testing of more than just one of our spacecraft systems including Mechanical, Electrical, Communications, Flight Control, Command & Data Handling, and Flight Software, etc.\n\nQualifications\n\nThe qualifications for Lynk Interns are\n• Enrolled in at least a bachelor’s degree or Masters or PhD in a STEM-related program.\n• Strong interpersonal skills and ability to work effectively in a team environment, accomplishing tasks with limited resources at a rapid pace.\n• Growing skill level using Windows and Linux OS, and proficiency with some other technical software package or programming.\n• Project experience with lab research, engineering project teams, or prior relevant internship or work.",
    "company": "Lynk",
    "location": "Washington, US",
    "url": "https://spacecrew.com/space-jobs/m8mz8ddb-lynk-software-engineering-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRsFBM3cxpnK5rAyTWmo_CB8EIqcPYmpOEixtwZ&s=0",
    "title": "Software Development Summer Internship",
    "description": "Software Development Summer 2026 Internship\n\nAre you interested in hands-on software development?\n\nOverview\n\nWe offer summer internship positions where you will be trained on full stack software development.\n\nThis is a mentorship program we are passionate about. Our top technical staff gathers together each year to design a fresh program that evolves with our technology needs. We focus on making sure you develop a strong foundation of knowledge to build your career on.\n\nThe two key areas of focus are:\n• Technical skills related to designing and building software.\n• Agile methodologies that enable teams to work effectively.\n\nYou'll get to meet other developers in the company, build products, and participate in team building activities. Software development is not just about delivering code, it is about creating a team and culture that can build great software.\n\nResponsibilities\n• Learn and work with a variety of technologies related to full stack development.\n• Participate in an Agile team environment to complete one or more web-based projects.\n\nPrerequisites\n• Strong grasp of basic Java programming (2-3 years of coding in school and other venues).\n• Creative ability to solve problems, especially logic problems.\n• A genuine interest in software development.\n\nHighly desired is software development work outside of school such as internships, personal projects, and hackathons.\n\nAbout SimonComputing, Inc.\n\nSimonComputing is dedicated to simplifying the process of building software. We specialize in developing technically challenging applications and serve clients in the public and private sectors.\n\nSimonComputing, Inc. is an Affirmative Action/Equal Opportunity Employer.\n\nJob Posted by ApplicantPro",
    "company": "SimonComputing",
    "location": "Alexandria, US",
    "url": "https://www.ziprecruiter.com/c/SimonComputing/Job/Software-Development-Summer-Internship/-in-Alexandria,VA?jid=adfa40bbc2f56b13&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTfjf6IJZsS9Ets5DXHu2OlLpgTfzhectCmAaFG&s=0",
    "title": "Summer 2026 Software Engineering Intern",
    "description": "Worker Type\n\nSupplemental\n\nJob Description\n\nOur Summer Internship Program is meticulously designed to provide students with an immersive and dynamic experience within our industry, offering a taste of what it's like to be part of our professional team. We strive to simulate a full-time job, enabling our interns to work hands-on with cutting-edge technology, contribute to meaningful projects, build strong relationships with coworkers, and develop strategic problem-solving skills. Our program is highly selective, hosting only a handful of interns each year, ensuring personalized attention and ample opportunities to work closely with AV team members.\n\nWe are hiring for various roles and locations throughout the US, during the interview process we will be able to discuss specific details regarding team and location.\n\nSummary\n\nAs a Software Engineering Intern, you'll be part of a collaborative, multidisciplinary team working on real-world projects across AV technology portfolio. You'll assist in the design, development, and testing of software solutions for a variety of applications - from ground control systems and user interfaces to data pipelines and simulation tools.\n\nThis role is ideal for someone who's eager to apply their software development skills in a dynamic, hands-on environment, while learning from experienced engineers and contributing to projects with real impact.\n\nPosition Responsibilities\n• Assist in the design, coding, testing, and debugging of software components and systems.\n• Contribute to the development of tools and applications that support AV robotics and aerospace platforms.\n• Collaborate with engineers across software, hardware, and systems teams to integrate and test new capabilities.\n• Participate in code reviews, documentation, and the use of version control and defect tracking tools.\n• Help develop scripts or automation to improve team workflows and efficiency.\n• Learn and apply best practices in software development processes, including Agile methodologies.\n• Support the development of prototypes, simulations, and proof-of-concept demonstrations.\n• Attend team meetings, contribute ideas, and learn to estimate development effort and timelines.\n\nBasic Qualifications (Required Skills & Experience)\n• Currently pursuing a Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field.\n• Strong foundational knowledge in programming languages such as Python, C++, or Java.\n• Familiarity with development tools such as Visual Studio, Git, Eclipse, or similar IDEs.\n• Experience with data structures, algorithms, and software design principles.\n• Demonstrated problem-solving and analytical skills.\n• Ability to work both independently and collaboratively in a team environment.\n• Effective written and verbal communication skills.\n\nPreferred Qualifications & Competencies\n• Experience with software development on Linux, Windows, or cross-platform environments.\n• Exposure to web technologies, cloud platforms, or backend services is a plus.\n• Interest in or exposure to robotics, autonomous systems, or data analytics.\n• Experience using scripting languages (e.g., Bash, Python) to automate tasks.\n• Knowledge of Agile development practices and version control (e.g., Git).\n• Curiosity and willingness to learn new technologies and frameworks.\n• Ability to take ownership of tasks and contribute to team goals.\n\nPhysical Demands\n• Ability to work in an office and R&D lab environment (Constant)\n• Required to sit, type, and use office equipment for extended periods (Frequent)\n\nITAR Requirement:\n\nThis position requires access to information that is subject to compliance with the International Traffic Arms Regulations (\"ITAR\") and/or the Export Administration Regulations (\"EAR\"). In order to comply with the requirements of the ITAR and/or the EAR, applicants must qualify as a U.S. person under the ITAR and the EAR, or a person to be approved for an export license by the governing agency whose technology comes under its jurisdiction. Please understand that any job offer that requires approval of an export license will be conditional on AeroVironment's determination that it will be able to obtain an export license in a time frame consistent with AeroVironment's business requirements. A \"U.S. person\" according to the ITAR definition is a U.S. citizen, U.S. lawful permanent resident (green card holder), or protected individual such as a refugee or asylee. See 22 CFR 120.15. Some positions will require current U.S. Citizenship due to contract requirements.\n\nBenefits: AV offers an excellent benefits package including medical, dental vision, 401K with company matching, a 9/80 work schedule and a paid holiday shutdown. For more information about our company benefit offerings please visit: http://www.avinc.com/myavbenefits.\n\nWe also encourage you to review our company website at http://www.avinc.com to learn more about us.\n\nPrincipals only need apply. NO agencies please.\n\nWho We Are\n\nBased in California, AeroVironment (AVAV) is a global leader in unmanned aircraft systems (UAS) and tactical missile systems. Founded in 1971 by celebrated physicist and engineer, Dr. Paul MacCready, we've been at the leading edge of technical innovation for more than 45 years. Be a part of the team that developed the world's most widely used military drones and created the first submarine-launched reconnaissance drone, and has seven innovative vehicles that are part of the Smithsonian Institution's permanent collection in Washington, DC.\n\nJoin us today in developing the next generation of small UAS and tactical missile systems that will deliver more actionable intelligence to our customers so they can proceed with certainty - and succeed.\n\nWhat We Do\n\nBuilding on a history of technological innovation, AeroVironment designs, develops, produces, and supports an advanced portfolio of unmanned aircraft systems (UAS) and tactical missile systems. Agencies of the U.S. Department of Defense and allied military services use the company's hand-launched UAS to provide situational awareness to tactical operating units through real-time, airborne reconnaissance, surveillance, and target acquisition.\n\nWe are proud to be an EEO/AA Equal Opportunity Employer, including disability/veterans. AeroVironment, Inc. is an Equal Employment Opportunity (EEO) employer and welcomes all qualified applicants. Qualified applicants will receive fair and impartial consideration without regard to race, sex, color, religion, national origin, age, disability, protected veteran status, genetic data,sexual orientation, gender identity or other legally protected status.\n\nITAR",
    "company": "AeroVironment",
    "location": "Arlington, US",
    "url": "https://www.ziprecruiter.com/c/AeroVironment/Job/Summer-2026-Software-Engineering-Intern/-in-Arlington,VA?jid=e1e4c003d9df6d83&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSHzeWSHeUEOdLfvkvU7i0pK1ejittkiAxqQmMe&s=0",
    "title": "Software Engineering Intern",
    "description": "Here at Appian, our values of Intensity and Excellence define who we are. We set high standards and live up to them, ensuring that everything we do is done with care and quality. We approach every challenge with ambition and commitment, holding ourselves and each other accountable to achieve the best results. When you join Appian, you'll be part of a passionate team dedicated to accomplishing hard things, together.\n\nHere at Appian, we're passionate about technology. We love making it, and we love using it. Joining Appian Engineering will provide you with the opportunity to learn in an environment that values cross-functional collaboration and is committed to personal and professional growth. We want to revolutionize the way people work, and in doing so, we develop the Appian platform to be simple so our customers can thrive.\n\nWe're looking for Software Engineering interns who are passionate about solving some of the most difficult technical challenges the industry faces today. We're looking for interns who are not only adept at abstract problem solving but also want to be hands-on with fellow developers in one of the most fun, all-in, high-velocity environments you'll ever experience.\n\nThis internship is based at our headquarters in McLean, Virginia. Appian was built on a culture of in-person collaboration, which we believe is a key driver of our mission to be the best. Interns in this program are expected to be in the office 5 days a week to fully experience our culture, learn directly from peers and mentors, and contribute to projects in a collaborative environment. Being in the office provides more opportunities to connect, learn, and celebrate with the exceptional people across Appian.\n\nApplicants considered for Summer 2026 - Undergraduate Only\n\nTo be successful in this role, you need:\n• Previous industry software development experience and a passion for technology.\n• Drive to dig into the code, pair program as needed, collaborate and present your features and proposals to real stakeholders.\n• Team-oriented mindset and collaborative approach to delivering solutions. You're also energetic, results and delivery oriented, and have a strong commitment to delivering quality work.\n• Familiarity in object-oriented programming languages, such as Java & C++\n\nBasic qualifications:\n• Undergraduate student pursuing a Bachelor's degree in Computer Science, Information Technology, Computer Engineering or related field\n• Strong analytical, communication, and problem solving skills\n\nTools and Resources\n• Training and Development: During onboarding, we focus on equipping new hires with the skills and knowledge for success through department-specific training. Continuous learning is a central focus at Appian, with dedicated mentorship and the First-Friend program being widely utilized resources for new hires.\n• Growth Opportunities: Appian provides a diverse array of growth and development opportunities, including our leadership program tailored for new and aspiring managers, a comprehensive library of specialized department training through Appian University, skills based training, and tuition reimbursement for those aiming to advance their education. This commitment ensures that employees have access to a holistic range of development opportunities.\n• Community: We'll immerse you into our community rooted in respect starting on day one. Appian fosters inclusivity through our 8 employee-led affinity groups. These groups help employees build stronger internal and external networks by planning social, educational, and outreach activities to connect with Appianites and larger initiatives throughout the company.\n\nAbout Appian\n\nAppian is a software company that automates business processes. The Appian AI-Powered Process Platform includes everything you need to design, automate, and optimize even the most complex processes, from start to finish. The world's most innovative organizations trust Appian to improve their workflows, unify data, and optimize operations—resulting in better growth and superior customer experiences. For more information, visit appian.com. [Nasdaq: APPN]\n\nFollow Appian: LinkedIn.\n\nAppian is an equal opportunity employer that strives to attract and retain the best talent. All qualified applicants will receive consideration for employment without regard to any characteristic protected by applicable federal, state, or local law.\n\nAppian provides reasonable accommodations to applicants in accordance with all applicable laws. If you need a reasonable accommodation for any part of the employment process, please contact us by email at ReasonableAccommodations@appian.com. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.\n\nAppian's Applicant & Candidate Privacy Notice",
    "company": "Appian Corporation",
    "location": "McLean, US",
    "url": "https://www.ziprecruiter.com/c/Appian-Corporation/Job/Software-Engineering-Intern/-in-McLean,VA?jid=e3b3caaba4bb2f41&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQORF7mBhAVXWaRFsrtceplv5CCggAYyLmnJX1P&s=0",
    "title": "Federal Data Engineer Intern: 2026",
    "description": "Introduction\n\nA career in IBM Consulting is rooted in long-term relationships and close collaboration with clients across the globe.\n\nYou'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio, including Software and Red Hat.\n\nCuriosity and a constant quest for knowledge serve as the foundation for success in IBM Consulting-Federal. In your role, you'll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions that result in ground-breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nYour role and responsibilities\n\nDuring your internship, you can enhance your knowledge and gain professional experience by working on client projects. This role provides an exceptional opportunity to build a compelling portfolio, acquire new skills, gain insights into diverse industries, and embrace novel challenges for your future career.\n\nAt IBM, we prioritize continuous learning, skill development, and personal growth within a culture of coaching and mentorship. As an intern, you'll experience this culture and could advance to our associate program based on results and performance.\n\nWork experiences you could be exposed to:\n• Mentored Analytical Support: Receive mentorship from diverse professionals in science engineering and consulting applying analytical rigor and statistical methods to predict behaviors.\n• Data Integrations: Develop skills in writing efficient and reusable programs to cleanse integrate and model data. Evaluate model results contributing to data-driven insights.\n• Effective Communication: Assist in conveying analytical results to both technical and non-technical audiences, refining your ability to communicate complex findings.\n• Tech-Driven Data Transformer: Utilize program languages like Python to build data pipelines, extracting and transforming data from repositories to consumers. Gain exposure to cloud platforms, ETL tools, and data integration, expanding your tech toolkit.\n\nThese positions are anticipated to start in summer 2026. We have positions open in the following location: Washington DC Metro Area\n\nCandidates must have the ability to obtain and maintain a Federal security clearance while in IBM Federal Consulting.\n\nThe below requirements are guidelines. If you have transferable skills, we encourage you to apply for this role.\n\nRequired education\n\nHigh School Diploma/GED\n\nRequired technical and professional expertise\n• Must have the ability to obtain and maintain a Federal security clearance while in IBM Consulting - Federal\n• Willingness to travel up to 100%\n• Currently pursuing a quantitative degree in Computer Science, Statistics, Mathematics, Engineering, or a related field\n• Strong Interpersonal skills that enhance collaboration and relationship building, while also managing dynamic workloads in an agile environment\n• Have initiative and passion to actively seek new knowledge and improve skills while embracing a growth mindset to assimilate diverse viewpoints\n• Demonstrate leadership experience and ability to communicate effectively through active listening; while also be willing to adapt and have a readiness to take ownership of tasks and challenges\n• Familiarity with one or more scripting languages (Python preferred), or a proven computer science foundation\n\nPreferred technical and professional experience\n• Demonstrate familiarity or interest in statistical analysis or data mining through previous internships, personal/academic projects, hackathons, and/or publications\n• General familiarity with databases, data-engineering tools (SQL, spark) and cloud platforms (e.g., IBM Cloud, Azure, AWS). Experience with NLP/LLM/GenAI is a plus\n• Experience using machine-learning/data science libraries in python (scikit-learn, SciPy, pandas, PyTorch) is a plus\n\nABOUT BUSINESS UNIT\n\nIBM Consulting is IBM's consulting and global professional services business, with market leading capabilities in business and technology transformation. With deep expertise in many industries, we offer strategy, experience, technology, and operations services to many of the most innovative and valuable companies in the world. Our people are focused on accelerating our clients' businesses through the power of collaboration. We believe in the power of technology responsibly used to help people, partners and the planet.\n\nYOUR LIFE @ IBM\n\nIn a world where technology never stands still, we understand that, dedication to our clients success, innovation that matters, and trust and personal responsibility in all our relationships, lives in what we do as IBMers as we strive to be the catalyst that makes the world work better.\n\nBeing an IBMer means you'll be able to learn and develop yourself and your career, you'll be encouraged to be courageous and experiment everyday, all whilst having continuous trust and support in an environment where everyone can thrive whatever their personal or professional background.\n\nOur IBMers are growth minded, always staying curious, open to feedback and learning new information and skills to constantly transform themselves and our company. They are trusted to provide on-going feedback to help other IBMers grow, as well as collaborate with colleagues keeping in mind a team focused approach to include different perspectives to drive exceptional outcomes for our customers. The courage our IBMers have to make critical decisions everyday is essential to IBM becoming the catalyst for progress, always embracing challenges with resources they have to hand, a can-do attitude and always striving for an outcome focused approach within everything that they do.\n\nAre you ready to be an IBMer?\n\nABOUT IBM\n\nIBM's greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.\n\nRestlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we're also one of the biggest technology and consulting employers, with many of the Fortune 500 companies relying on the IBM Cloud to run their business.\n\nAt IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it's time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\nIBM is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, neurodivergence, age, or other characteristics protected by the applicable law. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.\n\nOTHER RELEVANT JOB DETAILS\n\nSupplemental 1 employees may be eligible for up to 8 paid holidays, minimum of 56 hours paid sick time and the IBM Employee Stock Purchase Plan. IBM offers paid family medical leave and disability benefits to eligible employees where required by applicable law.\nThis position was posted on the date cited in the key job details section and is anticipated to remain posted for 21 days from this date or less if not needed to fill the role.\nWe consider qualified applicants with criminal histories, consistent with applicable law.\n\nIBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship.",
    "company": "IBM",
    "location": "Washington, US",
    "url": "https://www.dice.com/job-detail/64cf3391-1a55-4af9-8ac7-627e48d1b663?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQnGi2f4uoxgnabfk515UOSB5L5BbLT5Hq0qaii&s=0",
    "title": "data engineer intern - summer 2025",
    "description": "About the position\n\nResponsibilities\n• Code Analysis & Optimization: Understand and improve the current script for efficiency and scalability.\n• Feature Implementation: Add new features to support additional assay types or data configurations.\n• Database Interaction: Write and debug SQL queries integrated into the Python script to fetch and process assay data.\n• Data Transformation: Work on transforming raw database outputs into meaningful, organized outputs (such as JSON) for further analysis.\n• Error Handling: Enhance exception handling and logging mechanisms for more robust performance.\n• Collaboration: Work with team members and multiple different cross-functional teams to ensure code quality and alignment with project goals.\n\nRequirements\n• Currently pursuing a graduate level degree in Computer Science, Computer Engineering, Data Science, Data Analytics, or a related field.\n• Proficient in Python with familiarity in libraries like sqlalchemy, io, and simplejson.\n• Understanding of SQL and experience interacting with relational databases.\n• Familiarity with JSON or similar data formats is beneficial.\n• Knowledge of Git/Bitbucket and comfortable working with version control systems.\n\nNice-to-haves\n• Debugging experience (1 year preferred)\n• SQL experience (1 year preferred)\n• JSON experience (1 year preferred)\n• Git experience (1 year preferred)\n• LIMS experience (1 year preferred)\n\nBenefits\n• Health insurance\n• 401K contribution\n• Incentive and recognition program",
    "company": "Randstad",
    "location": "Rockville, US",
    "url": "https://www.tealhq.com/job/data-engineer-intern-summer-2025_90d633f5-e5c4-4a6c-a5c6-fe88c21e5e78?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRUoWnvORN3t96zAGlyTr9GAzVkycm8CdNsiHDZ&s=0",
    "title": "Data Engineering Intern",
    "description": "About the position\n\nResponsibilities\n• Help to collect, consolidate, and map customer engagement data from various company platforms.\n• Ensure accuracy and consistency across the data ecosystem to create a unified view of the customer.\n• Meet with stakeholders and define business and technical requirements.\n• Collaborate in the design of the target data architecture and integration strategy.\n• Assist in the design and possible development of a user-friendly application that enables cross-departmental access to insights.\n• Apply a data-centric mindset and understanding of information architecture to analyze trends, identify gaps, and support initiatives for improving data flow and accessibility.\n\nRequirements\n• Must be enrolled in BS/MS/PhD degree program with graduation dates between December 2024-June 2026.\n• Knowledge of data storage technologies like databases, data lakes, and data warehouses.\n• Experience or exposure to understanding of data normalization, indexing, and data relationships.\n• Familiarity with Agile development processes.\n• Familiarity with cloud platforms for data engineering tasks.\n• Problem-solving skills to handle large and complex datasets efficiently.\n\nNice-to-haves\n• Interest in Analytics, AI, and LLM is a big plus.\n\nBenefits\n• Flexible work model\n• People-first culture\n• Focus on well-being\n• Diversity, Equity, and Inclusion commitment",
    "company": "Teradata Operations",
    "location": "Annapolis, US",
    "url": "https://www.tealhq.com/job/data-engineering-intern_1fb49192-f4c7-4ea8-9eed-45db16d92039?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  },
  {
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTesf3c9WjKOITSsVKxCHp1YGdEiIormPg7UxY1&s=0",
    "title": "Data Engineer Intern (2026)",
    "description": "Figma is growing our team of passionate creatives and builders on a mission to make design accessible to all. Figma’s platform helps teams bring ideas to life—whether you're brainstorming, creating a prototype, translating designs into code, or iterating with AI. From idea to product, Figma empowers teams to streamline workflows, move faster, and work together in real time from anywhere in the world. If you're excited to shape the future of design and collaboration, join us!\n\nWe’re looking for Data Engineering Interns who are excited to help scale the systems and pipelines that power decision-making at Figma. As an intern on our data team, you’ll partner with engineers and analysts to design and build reliable datasets, ensure data quality, and make Figma’s data more accessible across the company.\n\nThis internship will be based out of our San Francisco or New York hub.\nWhat you’ll do at Figma:\n• Build and maintain data pipelines that connect different data sources\n• Help design foundational datasets that are trusted, well-documented, and easy to use\n• Optimize pipelines for performance and scalability as Figma grows\n• Partner with cross-functional teammates to understand data needs and deliver solutions\n• Contribute to the tools and practices that make working with data at Figma easier\nSome projects you could work on:\n• Develop new ETL jobs to integrate product or business data into our warehouse\n• Improve the performance and reliability of core pipelines\n• Build reusable datasets that support experimentation, product & business analytics, or cross-functional stakeholders\n• Document and simplify complex data workflows for broader use\nWe’d love to hear from you if you have:\n• Experience coding in Python (or a similar language) and writing SQL queries\n• Worked on projects that involved building or working with data pipelines, ETL, or large datasets\n• Curious about how data systems work and want to make them more scalable and reliable\n• Communicate well and enjoy collaborating with others\n• Are excited to learn, get feedback, and grow as an data engineer\n\nAt Figma, one of our values is Grow as you go. We believe in hiring smart, curious people who are excited to learn and develop their skills. If you’re excited about this role but your past experience doesn’t align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\n#LI-HO1\n\nPay Transparency Disclosure\n\nThis internship role is based in either Figma’s San Francisco or New York hub offices, and has the hourly base pay rate stated below. Figma also offers interns a housing stipend and travel reimbursement. Figma’s compensation and benefits are subject to change and may be modified in the future.\n\nInternship\n$44.71—$44.71 USD\n\nAt Figma we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product and our community to flourish. Figma is an equal opportunity workplace - we are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity/expression, veteran status, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n\nWe will work to ensure individuals with disabilities are provided reasonable accommodation to apply for a role, participate in the interview process, perform essential job functions, and receive other benefits and privileges of employment. If you require accommodation, please reach out to accommodations-ext@figma.com. These modifications enable an individual with a disability to have an equal opportunity not only to get a job, but successfully perform their job tasks to the same extent as people without disabilities.\n\nExamples of accommodations include but are not limited to:\n• Holding interviews in an accessible location\n• Enabling closed captioning on video conferencing\n• Ensuring all written communication be compatible with screen readers\n• Changing the mode or format of interviews\n\nTo ensure the integrity of our hiring process and facilitate a more personal connection, we require all candidates keep their cameras on during video interviews. Additionally, if hired you will be required to attend in person onboarding.\n\nBy applying for this job, the candidate acknowledges and agrees that any personal data contained in their application or supporting materials will be processed in accordance with Figma's Candidate Privacy Notice.",
    "company": "Figma",
    "location": "New York, US",
    "url": "https://www.purpose.jobs/discover/companies/figma-2/jobs/56926693-data-engineer-intern-2026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "created_at": null,
    "source": "JSearch"
  }
]
